[
  
    {
  "title": "Reconnaissance, Tactic TA0043 - Enterprise | MITRE ATT&CK®",
  "url": "https://attack.mitre.org/tactics/TA0043/",
  "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to SOC Prime for becoming ATT&CK's first Benefactor. To join them, or learn more about this program visit our Benefactors page.\nHome\nTactics\nEnterprise\nReconnaissance\nReconnaissance\n\nThe adversary is trying to gather information they can use to plan future operations.\n\nReconnaissance consists of techniques that involve adversaries actively or passively gathering information that can be used to support targeting. Such information may include details of the victim organization, infrastructure, or staff/personnel. This information can be leveraged by the adversary to aid in other phases of the adversary lifecycle, such as using gathered information to plan and execute Initial Access, to scope and prioritize post-compromise objectives, or to drive and lead further Reconnaissance efforts.\n\nID: TA0043\nCreated: 02 October 2020\nLast Modified: 18 October 2020\nVersion Permalink\nTechniques\nTechniques: 10\nID\tName\tDescription\nT1595\tActive Scanning\tAdversaries may execute active reconnaissance scans to gather information that can be used during targeting. Active scans are those where the adversary probes victim infrastructure via network traffic, as opposed to other forms of reconnaissance that do not involve direct interaction.\n\t.001\tScanning IP Blocks\tAdversaries may scan victim IP blocks to gather information that can be used during targeting. Public IP addresses may be allocated to organizations by block, or a range of sequential addresses.\n\t.002\tVulnerability Scanning\tAdversaries may scan victims for vulnerabilities that can be used during targeting. Vulnerability scans typically check if the configuration of a target host/application (ex: software and version) potentially aligns with the target of a specific exploit the adversary may seek to use.\n\t.003\tWordlist Scanning\tAdversaries may iteratively probe infrastructure using brute-forcing and crawling techniques. While this technique employs similar methods to Brute Force, its goal is the identification of content and infrastructure rather than the discovery of valid credentials. Wordlists used in these scans may contain generic, commonly used names and file extensions or terms specific to a particular software. Adversaries may also create custom, target-specific wordlists using data gathered from other Reconnaissance techniques (ex: Gather Victim Org Information, or Search Victim-Owned Websites).\nT1592\tGather Victim Host Information\tAdversaries may gather information about the victim's hosts that can be used during targeting. Information about hosts may include a variety of details, including administrative data (ex: name, assigned IP, functionality, etc.) as well as specifics regarding its configuration (ex: operating system, language, etc.).\n\t.001\tHardware\tAdversaries may gather information about the victim's host hardware that can be used during targeting. Information about hardware infrastructure may include a variety of details such as types and versions on specific hosts, as well as the presence of additional components that might be indicative of added defensive protections (ex: card/biometric readers, dedicated encryption hardware, etc.).\n\t.002\tSoftware\tAdversaries may gather information about the victim's host software that can be used during targeting. Information about installed software may include a variety of details such as types and versions on specific hosts, as well as the presence of additional components that might be indicative of added defensive protections (ex: antivirus, SIEMs, etc.).\n\t.003\tFirmware\tAdversaries may gather information about the victim's host firmware that can be used during targeting. Information about host firmware may include a variety of details such as type and versions on specific hosts, which may be used to infer more information about hosts in the environment (ex: configuration, purpose, age/patch level, etc.).\n\t.004\tClient Configurations\tAdversaries may gather information about the victim's client configurations that can be used during targeting. Information about client configurations may include a variety of details and settings, including operating system/version, virtualization, architecture (ex: 32 or 64 bit), language, and/or time zone.\nT1589\tGather Victim Identity Information\tAdversaries may gather information about the victim's identity that can be used during targeting. Information about identities may include a variety of details, including personal data (ex: employee names, email addresses, etc.) as well as sensitive details such as credentials.\n\t.001\tCredentials\tAdversaries may gather credentials that can be used during targeting. Account credentials gathered by adversaries may be those directly associated with the target victim organization or attempt to take advantage of the tendency for users to use the same passwords across personal and business accounts.\n\t.002\tEmail Addresses\tAdversaries may gather email addresses that can be used during targeting. Even if internal instances exist, organizations may have public-facing email infrastructure and addresses for employees.\n\t.003\tEmployee Names\tAdversaries may gather employee names that can be used during targeting. Employee names be used to derive email addresses as well as to help guide other reconnaissance efforts and/or craft more-believable lures.\nT1590\tGather Victim Network Information\tAdversaries may gather information about the victim's networks that can be used during targeting. Information about networks may include a variety of details, including administrative data (ex: IP ranges, domain names, etc.) as well as specifics regarding its topology and operations.\n\t.001\tDomain Properties\tAdversaries may gather information about the victim's network domain(s) that can be used during targeting. Information about domains and their properties may include a variety of details, including what domain(s) the victim owns as well as administrative data (ex: name, registrar, etc.) and more directly actionable information such as contacts (email addresses and phone numbers), business addresses, and name servers.\n\t.002\tDNS\tAdversaries may gather information about the victim's DNS that can be used during targeting. DNS information may include a variety of details, including registered name servers as well as records that outline addressing for a target’s subdomains, mail servers, and other hosts. DNS, MX, TXT, and SPF records may also reveal the use of third party cloud and SaaS providers, such as Office 365, G Suite, Salesforce, or Zendesk.\n\t.003\tNetwork Trust Dependencies\tAdversaries may gather information about the victim's network trust dependencies that can be used during targeting. Information about network trusts may include a variety of details, including second or third-party organizations/domains (ex: managed service providers, contractors, etc.) that have connected (and potentially elevated) network access.\n\t.004\tNetwork Topology\tAdversaries may gather information about the victim's network topology that can be used during targeting. Information about network topologies may include a variety of details, including the physical and/or logical arrangement of both external-facing and internal network environments. This information may also include specifics regarding network devices (gateways, routers, etc.) and other infrastructure.\n\t.005\tIP Addresses\tAdversaries may gather the victim's IP addresses that can be used during targeting. Public IP addresses may be allocated to organizations by block, or a range of sequential addresses. Information about assigned IP addresses may include a variety of details, such as which IP addresses are in use. IP addresses may also enable an adversary to derive other details about a victim, such as organizational size, physical location(s), Internet service provider, and or where/how their publicly-facing infrastructure is hosted.\n\t.006\tNetwork Security Appliances\tAdversaries may gather information about the victim's network security appliances that can be used during targeting. Information about network security appliances may include a variety of details, such as the existence and specifics of deployed firewalls, content filters, and proxies/bastion hosts. Adversaries may also target information about victim network-based intrusion detection systems (NIDS) or other appliances related to defensive cybersecurity operations.\nT1591\tGather Victim Org Information\tAdversaries may gather information about the victim's organization that can be used during targeting. Information about an organization may include a variety of details, including the names of divisions/departments, specifics of business operations, as well as the roles and responsibilities of key employees.\n\t.001\tDetermine Physical Locations\tAdversaries may gather the victim's physical location(s) that can be used during targeting. Information about physical locations of a target organization may include a variety of details, including where key resources and infrastructure are housed. Physical locations may also indicate what legal jurisdiction and/or authorities the victim operates within.\n\t.002\tBusiness Relationships\tAdversaries may gather information about the victim's business relationships that can be used during targeting. Information about an organization’s business relationships may include a variety of details, including second or third-party organizations/domains (ex: managed service providers, contractors, etc.) that have connected (and potentially elevated) network access. This information may also reveal supply chains and shipment paths for the victim’s hardware and software resources.\n\t.003\tIdentify Business Tempo\tAdversaries may gather information about the victim's business tempo that can be used during targeting. Information about an organization’s business tempo may include a variety of details, including operational hours/days of the week. This information may also reveal times/dates of purchases and shipments of the victim’s hardware and software resources.\n\t.004\tIdentify Roles\tAdversaries may gather information about identities and roles within the victim organization that can be used during targeting. Information about business roles may reveal a variety of targetable details, including identifiable information for key personnel as well as what data/resources they have access to.\nT1598\tPhishing for Information\tAdversaries may send phishing messages to elicit sensitive information that can be used during targeting. Phishing for information is an attempt to trick targets into divulging information, frequently credentials or other actionable information. Phishing for information is different from Phishing in that the objective is gathering data from the victim rather than executing malicious code.\n\t.001\tSpearphishing Service\tAdversaries may send spearphishing messages via third-party services to elicit sensitive information that can be used during targeting. Spearphishing for information is an attempt to trick targets into divulging information, frequently credentials or other actionable information. Spearphishing for information frequently involves social engineering techniques, such as posing as a source with a reason to collect information (ex: Establish Accounts or Compromise Accounts) and/or sending multiple, seemingly urgent messages.\n\t.002\tSpearphishing Attachment\tAdversaries may send spearphishing messages with a malicious attachment to elicit sensitive information that can be used during targeting. Spearphishing for information is an attempt to trick targets into divulging information, frequently credentials or other actionable information. Spearphishing for information frequently involves social engineering techniques, such as posing as a source with a reason to collect information (ex: Establish Accounts or Compromise Accounts) and/or sending multiple, seemingly urgent messages.\n\t.003\tSpearphishing Link\tAdversaries may send spearphishing messages with a malicious link to elicit sensitive information that can be used during targeting. Spearphishing for information is an attempt to trick targets into divulging information, frequently credentials or other actionable information. Spearphishing for information frequently involves social engineering techniques, such as posing as a source with a reason to collect information (ex: Establish Accounts or Compromise Accounts) and/or sending multiple, seemingly urgent messages.\n\t.004\tSpearphishing Voice\tAdversaries may use voice communications to elicit sensitive information that can be used during targeting. Spearphishing for information is an attempt to trick targets into divulging information, frequently credentials or other actionable information. Spearphishing for information frequently involves social engineering techniques, such as posing as a source with a reason to collect information (ex: Impersonation) and/or creating a sense of urgency or alarm for the recipient.\nT1597\tSearch Closed Sources\tAdversaries may search and gather information about victims from closed sources that can be used during targeting. Information about victims may be available for purchase from reputable private sources and databases, such as paid subscriptions to feeds of technical/threat intelligence data. Adversaries may also purchase information from less-reputable sources such as dark web or cybercrime blackmarkets.\n\t.001\tThreat Intel Vendors\tAdversaries may search private data from threat intelligence vendors for information that can be used during targeting. Threat intelligence vendors may offer paid feeds or portals that offer more data than what is publicly reported. Although sensitive details (such as customer names and other identifiers) may be redacted, this information may contain trends regarding breaches such as target industries, attribution claims, and successful TTPs/countermeasures.\n\t.002\tPurchase Technical Data\tAdversaries may purchase technical information about victims that can be used during targeting. Information about victims may be available for purchase within reputable private sources and databases, such as paid subscriptions to feeds of scan databases or other data aggregation services. Adversaries may also purchase information from less-reputable sources such as dark web or cybercrime blackmarkets.\nT1596\tSearch Open Technical Databases\tAdversaries may search freely available technical databases for information about victims that can be used during targeting. Information about victims may be available in online databases and repositories, such as registrations of domains/certificates as well as public collections of network data/artifacts gathered from traffic and/or scans.\n\t.001\tDNS/Passive DNS\tAdversaries may search DNS data for information about victims that can be used during targeting. DNS information may include a variety of details, including registered name servers as well as records that outline addressing for a target’s subdomains, mail servers, and other hosts.\n\t.002\tWHOIS\tAdversaries may search public WHOIS data for information about victims that can be used during targeting. WHOIS data is stored by regional Internet registries (RIR) responsible for allocating and assigning Internet resources such as domain names. Anyone can query WHOIS servers for information about a registered domain, such as assigned IP blocks, contact information, and DNS nameservers.\n\t.003\tDigital Certificates\tAdversaries may search public digital certificate data for information about victims that can be used during targeting. Digital certificates are issued by a certificate authority (CA) in order to cryptographically verify the origin of signed content. These certificates, such as those used for encrypted web traffic (HTTPS SSL/TLS communications), contain information about the registered organization such as name and location.\n\t.004\tCDNs\tAdversaries may search content delivery network (CDN) data about victims that can be used during targeting. CDNs allow an organization to host content from a distributed, load balanced array of servers. CDNs may also allow organizations to customize content delivery based on the requestor’s geographical region.\n\t.005\tScan Databases\tAdversaries may search within public scan databases for information about victims that can be used during targeting. Various online services continuously publish the results of Internet scans/surveys, often harvesting information such as active IP addresses, hostnames, open ports, certificates, and even server banners.\nT1593\tSearch Open Websites/Domains\tAdversaries may search freely available websites and/or domains for information about victims that can be used during targeting. Information about victims may be available in various online sites, such as social media, new sites, or those hosting information about business operations such as hiring or requested/rewarded contracts.\n\t.001\tSocial Media\tAdversaries may search social media for information about victims that can be used during targeting. Social media sites may contain various information about a victim organization, such as business announcements as well as information about the roles, locations, and interests of staff.\n\t.002\tSearch Engines\tAdversaries may use search engines to collect information about victims that can be used during targeting. Search engine services typical crawl online sites to index context and may provide users with specialized syntax to search for specific keywords or specific types of content (i.e. filetypes).\n\t.003\tCode Repositories\tAdversaries may search public code repositories for information about victims that can be used during targeting. Victims may store code in repositories on various third-party websites such as GitHub, GitLab, SourceForge, and BitBucket. Users typically interact with code repositories through a web application or command-line utilities such as git.\nT1594\tSearch Victim-Owned Websites\tAdversaries may search websites owned by the victim for information that can be used during targeting. Victim-owned websites may contain a variety of details, including names of departments/divisions, physical locations, and data about key employees such as names, roles, and contact info (ex: Email Addresses). These sites may also have details highlighting business operations and relationships.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
},

{
  "title": "Gather Victim Identity Information: Credentials, Sub-technique T1589.001 - Enterprise | MITRE ATT&CK®",
  "url": "https://attack.mitre.org/techniques/T1589/001/",
  "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nGather Victim Identity Information\nCredentials\nGather Victim Identity Information: Credentials\nOther sub-techniques of Gather Victim Identity Information (3)\n\nAdversaries may gather credentials that can be used during targeting. Account credentials gathered by adversaries may be those directly associated with the target victim organization or attempt to take advantage of the tendency for users to use the same passwords across personal and business accounts.\n\nAdversaries may gather credentials from potential victims in various ways, such as direct elicitation via Phishing for Information. Adversaries may also compromise sites then add malicious content designed to collect website authentication cookies from visitors.[1] Credential information may also be exposed to adversaries via leaks to online or other accessible data sets (ex: Search Engines, breach dumps, code repositories, etc.).[2][3][4][5][6][7][8] Adversaries may also purchase credentials from dark web or other black-markets. Finally, where multi-factor authentication (MFA) based on out-of-band communications is in use, adversaries may compromise a service provider to gain access to MFA codes and one-time passwords (OTP).[9]\n\nGathering this information may reveal opportunities for other forms of reconnaissance (ex: Search Open Websites/Domains or Phishing for Information), establishing operational resources (ex: Compromise Accounts), and/or initial access (ex: External Remote Services or Valid Accounts).\n\nID: T1589.001\nSub-technique of:  T1589\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nContributors: Lee Christensen, SpecterOps; Toby Kohlenberg; Vinayak Wadhwa, Lucideus\nVersion: 1.1\nCreated: 02 October 2020\nLast Modified: 14 April 2023\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nG0007\tAPT28\t\n\nAPT28 has harvested user's login credentials.[10]\n\n\nC0027\tC0027\t\n\nDuring C0027, Scattered Spider sent phishing messages via SMS to steal credentials.[11]\n\n\nG0114\tChimera\t\n\nChimera has collected credentials for the target organization from previous breaches for use in brute force attacks.[12]\n\n\nG1004\tLAPSUS$\t\n\nLAPSUS$ has gathered user identities and credentials to gain initial access to a victim's organization; the group has also called an organization's help desk to reset a target's credentials.[13][14]\n\n\nG0065\tLeviathan\t\n\nLeviathan has collected compromised credentials to use for targeting efforts.[15]\n\n\nG0059\tMagic Hound\t\n\nMagic Hound gathered credentials from two victims that they then attempted to validate across 75 different websites. Magic Hound has also collected credentials from over 900 Fortinet VPN servers in the US, Europe, and Israel.[16][17]\n\n\nC0024\tSolarWinds Compromise\t\n\nFor the SolarWinds Compromise, APT29 conducted credential theft operations to obtain credentials to be used for access to victim environments.[18]\n\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nBlasco, J. (2014, August 28). Scanbox: A Reconnaissance Framework Used with Watering Hole Attacks. Retrieved October 19, 2020.\nThomson, I. (2017, September 26). Deloitte is a sitting duck: Key systems with RDP open, VPN and proxy 'login details leaked'. Retrieved October 19, 2020.\nMcCarthy, K. (2015, February 28). FORK ME! Uber hauls GitHub into court to find who hacked database of 50,000 drivers. Retrieved October 19, 2020.\nDetectify. (2016, April 28). Slack bot token leakage exposing business critical information. Retrieved October 19, 2020.\nSandvik, R. (2014, January 14). Attackers Scrape GitHub For Cloud Service Credentials, Hijack Account To Mine Virtual Currency. Retrieved October 19, 2020.\nDylan Ayrey. (2016, December 31). truffleHog. Retrieved October 19, 2020.\nMichael Henriksen. (2018, June 9). Gitrob: Putting the Open Source in OSINT. Retrieved October 19, 2020.\nNg, A. (2019, January 17). Massive breach leaks 773 million email addresses, 21 million passwords. Retrieved October 20, 2020.\nOkta. (2022, August 25). Detecting Scatter Swine: Insights into a Relentless Phishing Campaign. Retrieved February 24, 2023.\nBurt, T. (2020, September 10). New cyberattacks targeting U.S. elections. Retrieved March 24, 2021.\nParisi, T. (2022, December 2). Not a SIMulation: CrowdStrike Investigations Reveal Intrusion Campaign Targeting Telco and BPO Companies. Retrieved June 30, 2023.\nJansen, W . (2021, January 12). Abusing cloud services to fly under the radar. Retrieved January 19, 2021.\nMSTIC, DART, M365 Defender. (2022, March 24). DEV-0537 Criminal Actor Targeting Organizations for Data Exfiltration and Destruction. Retrieved May 17, 2022.\nBrown, D., et al. (2022, April 28). LAPSUS$: Recent techniques, tactics and procedures. Retrieved December 22, 2022.\nCISA. (2021, July 19). (AA21-200A) Joint Cybersecurity Advisory – Tactics, Techniques, and Procedures of Indicted APT40 Actors Associated with China’s MSS Hainan State Security Department. Retrieved August 12, 2021.\nWikoff, A. Emerson, R. (2020, July 16). New Research Exposes Iranian Threat Group Operations. Retrieved March 8, 2021.\nMSTIC. (2021, November 16). Evolving trends in Iranian threat actor activity – MSTIC presentation at CyberWarCon 2021. Retrieved January 12, 2023.\nCrowdStrike. (2022, January 27). Early Bird Catches the Wormhole: Observations from the StellarParticle Campaign. Retrieved February 7, 2022.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
},
{
  "title": "Gather Victim Identity Information: Employee Names, Sub-technique T1589.003 - Enterprise | MITRE ATT&CK®",
  "url": "https://attack.mitre.org/techniques/T1589/003/",
  "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nGather Victim Identity Information\nEmployee Names\nGather Victim Identity Information: Employee Names\nOther sub-techniques of Gather Victim Identity Information (3)\n\nAdversaries may gather employee names that can be used during targeting. Employee names be used to derive email addresses as well as to help guide other reconnaissance efforts and/or craft more-believable lures.\n\nAdversaries may easily gather employee names, since they may be readily available and exposed via online or other accessible data sets (ex: Social Media or Search Victim-Owned Websites).[1] Gathering this information may reveal opportunities for other forms of reconnaissance (ex: Search Open Websites/Domains or Phishing for Information), establishing operational resources (ex: Compromise Accounts), and/or initial access (ex: Phishing or Valid Accounts).\n\nID: T1589.003\nSub-technique of:  T1589\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.0\nCreated: 02 October 2020\nLast Modified: 15 April 2021\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nG0094\tKimsuky\t\n\nKimsuky has collected victim employee name information.[2]\n\n\nG0034\tSandworm Team\t\n\nSandworm Team's research of potential victim organizations included the identification and collection of employee information.[3]\n\n\nG0122\tSilent Librarian\t\n\nSilent Librarian has collected lists of names for individuals from targeted organizations.[4]\n\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nCybersecurity Resource Center. (n.d.). CYBERSECURITY INCIDENTS. Retrieved October 20, 2020.\nKISA. (n.d.). Phishing Target Reconnaissance and Attack Resource Analysis Operation Muzabi. Retrieved March 7, 2022.\nScott W. Brady. (2020, October 15). United States vs. Yuriy Sergeyevich Andrienko et al.. Retrieved November 25, 2020.\nDOJ. (2018, March 23). U.S. v. Rafatnejad et al . Retrieved February 3, 2021.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
},
{
  "title": "Gather Victim Identity Information: Email Addresses, Sub-technique T1589.002 - Enterprise | MITRE ATT&CK®",
  "url": "https://attack.mitre.org/techniques/T1589/002/",
  "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nGather Victim Identity Information\nEmail Addresses\nGather Victim Identity Information: Email Addresses\nOther sub-techniques of Gather Victim Identity Information (3)\n\nAdversaries may gather email addresses that can be used during targeting. Even if internal instances exist, organizations may have public-facing email infrastructure and addresses for employees.\n\nAdversaries may easily gather email addresses, since they may be readily available and exposed via online or other accessible data sets (ex: Social Media or Search Victim-Owned Websites).[1][2] Email addresses could also be enumerated via more active means (i.e. Active Scanning), such as probing and analyzing responses from authentication services that may reveal valid usernames in a system.[3] For example, adversaries may be able to enumerate email addresses in Office 365 environments by querying a variety of publicly available API endpoints, such as autodiscover and GetCredentialType.[4][5]\n\nGathering this information may reveal opportunities for other forms of reconnaissance (ex: Search Open Websites/Domains or Phishing for Information), establishing operational resources (ex: Email Accounts), and/or initial access (ex: Phishing or Brute Force via External Remote Services).\n\nID: T1589.002\nSub-technique of:  T1589\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nContributors: Jannie Li, Microsoft Threat Intelligence Center (MSTIC)\nVersion: 1.2\nCreated: 02 October 2020\nLast Modified: 21 October 2022\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nS0677\tAADInternals\t\n\nAADInternals can check for the existence of user email addresses using public Microsoft APIs.[6][7]\n\n\nG0050\tAPT32\t\n\nAPT32 has collected e-mail addresses for activists and bloggers in order to target them with spyware.[8]\n\n\nG1011\tEXOTIC LILY\t\n\nEXOTIC LILY has gathered targeted individuals' e-mail addresses through open source research and website contact forms.[9]\n\n\nG0125\tHAFNIUM\t\n\nHAFNIUM has collected e-mail addresses for users they intended to target.[10]\n\n\nG1001\tHEXANE\t\n\nHEXANE has targeted executives, human resources staff, and IT personnel for spearphishing.[11][12]\n\n\nG0094\tKimsuky\t\n\nKimsuky has collected valid email addresses that were subsequently used in spearphishing campaigns.[13]\n\n\nG1004\tLAPSUS$\t\n\nLAPSUS$ has gathered employee email addresses, including personal accounts, for social engineering and initial access efforts.[14]\n\n\nG0032\tLazarus Group\t\n\nLazarus Group collected email addresses belonging to various departments of a targeted organization which were used in follow-on phishing campaigns.[15]\n\n\nG0059\tMagic Hound\t\n\nMagic Hound has identified high-value email accounts in academia, journalism, NGO's, foreign policy, and national security for targeting.[16][17]\n\n\nG0069\tMuddyWater\t\n\nMuddyWater has specifically targeted government agency employees with spearphishing e-mails.[18]\n\n\nG0034\tSandworm Team\t\n\nSandworm Team has obtained valid emails addresses while conducting research against target organizations that were subsequently used in spearphishing campaigns.[19]\n\n\nG0122\tSilent Librarian\t\n\nSilent Librarian has collected e-mail addresses from targeted organizations from open Internet searches.[20]\n\n\nG0127\tTA551\t\n\nTA551 has used spoofed company emails that were acquired from email clients on previously infected hosts to target other individuals.[21]\n\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\nID\tData Source\tData Component\tDetects\nDS0029\tNetwork Traffic\tNetwork Traffic Content\t\n\nMonitor for suspicious network traffic that could be indicative of probing for email addresses and/or usernames, such as large/iterative quantities of authentication requests originating from a single source (especially if the source is known to be associated with an adversary/botnet). Analyzing web metadata may also reveal artifacts that can be attributed to potentially malicious activity, such as referer or user-agent string HTTP/S fields.\n\nReferences\nHackers Arise. (n.d.). Email Scraping and Maltego. Retrieved October 20, 2020.\nNg, A. (2019, January 17). Massive breach leaks 773 million email addresses, 21 million passwords. Retrieved October 20, 2020.\nGrimHacker. (2017, July 24). Office365 ActiveSync Username Enumeration. Retrieved December 9, 2021.\ngremwell. (2020, March 24). Office 365 User Enumeration. Retrieved May 27, 2022.\nDr. Nestori Syynimaa. (2020, June 13). Just looking: Azure Active Directory reconnaissance as an outsider. Retrieved May 27, 2022.\nDr. Nestori Syynimaa. (2018, October 25). AADInternals. Retrieved February 18, 2022.\nDr. Nestori Syynimaa. (2020, June 13). Just looking: Azure Active Directory reconnaissance as an outsider. Retrieved February 1, 2022.\nAmnesty International. (2021, February 24). Vietnamese activists targeted by notorious hacking group. Retrieved March 1, 2021.\nStolyarov, V. (2022, March 17). Exposing initial access broker with ties to Conti. Retrieved August 18, 2022.\nGruzweig, J. et al. (2021, March 2). Operation Exchange Marauder: Active Exploitation of Multiple Zero-Day Microsoft Exchange Vulnerabilities. Retrieved March 3, 2021.\nSecureWorks 2019, August 27 LYCEUM Takes Center Stage in Middle East Campaign Retrieved. 2019/11/19\nClearSky Cyber Security . (2021, August). New Iranian Espionage Campaign By “Siamesekitten” - Lyceum. Retrieved June 6, 2022.\nJazi, H. (2021, June 1). Kimsuky APT continues to target South Korean government using AppleSeed backdoor. Retrieved June 10, 2021.\nMSTIC, DART, M365 Defender. (2022, March 24). DEV-0537 Criminal Actor Targeting Organizations for Data Exfiltration and Destruction. Retrieved May 17, 2022.\nVyacheslav Kopeytsev and Seongsu Park. (2021, February 25). Lazarus targets defense industry with ThreatNeedle. Retrieved October 27, 2021.\nMiller, J. et al. (2021, July 13). Operation SpoofedScholars: A Conversation with TA453. Retrieved August 18, 2021.\nBash, A. (2021, October 14). Countering threats from Iran. Retrieved January 4, 2023.\nMele, G. et al. (2021, February 10). Probable Iranian Cyber Actors, Static Kitten, Conducting Cyberespionage Campaign Targeting UAE and Kuwait Government Agencies. Retrieved March 17, 2021.\nScott W. Brady. (2020, October 15). United States vs. Yuriy Sergeyevich Andrienko et al.. Retrieved November 25, 2020.\nDOJ. (2018, March 23). U.S. v. Rafatnejad et al . Retrieved February 3, 2021.\nDuncan, B. (2021, January 7). TA551: Email Attack Campaign Switches from Valak to IcedID. Retrieved March 17, 2021.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
},
{
  "title": "Gather Victim Identity Information, Technique T1589 - Enterprise | MITRE ATT&CK®",
  "url": "https://attack.mitre.org/techniques/T1589/",
  "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nGather Victim Identity Information\nGather Victim Identity Information\nSub-techniques (3)\n\nAdversaries may gather information about the victim's identity that can be used during targeting. Information about identities may include a variety of details, including personal data (ex: employee names, email addresses, etc.) as well as sensitive details such as credentials.\n\nAdversaries may gather this information in various ways, such as direct elicitation via Phishing for Information. Information about users could also be enumerated via other active means (i.e. Active Scanning) such as probing and analyzing responses from authentication services that may reveal valid usernames in a system.[1] Information about victims may also be exposed to adversaries via online or other accessible data sets (ex: Social Media or Search Victim-Owned Websites).[2][3][4][5][6][7][8][9]\n\nGathering this information may reveal opportunities for other forms of reconnaissance (ex: Search Open Websites/Domains or Phishing for Information), establishing operational resources (ex: Compromise Accounts), and/or initial access (ex: Phishing or Valid Accounts).\n\nID: T1589\nSub-techniques:  T1589.001, T1589.002, T1589.003\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nContributors: Jannie Li, Microsoft Threat Intelligence Center (MSTIC)\nVersion: 1.2\nCreated: 02 October 2020\nLast Modified: 21 April 2022\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nG0050\tAPT32\t\n\nAPT32 has conducted targeted surveillance against activists and bloggers.[10]\n\n\nG1016\tFIN13\t\n\nFIN13 has researched employees to target for social engineering attacks.[11]\n\n\nG1001\tHEXANE\t\n\nHEXANE has identified specific potential victims at targeted organizations.[12]\n\n\nG1004\tLAPSUS$\t\n\nLAPSUS$ has gathered detailed information of target employees to enhance their social engineering lures.[13]\n\n\nG0059\tMagic Hound\t\n\nMagic Hound has acquired mobile phone numbers of potential targets, possibly for mobile malware or additional phishing operations.[14]\n\n\nC0022\tOperation Dream Job\t\n\nFor Operation Dream Job, Lazarus Group conducted extensive reconnaissance research on potential targets.[15]\n\n\nC0014\tOperation Wocao\t\n\nDuring Operation Wocao, threat actors targeted people based on their organizational roles and privileges.[16]\n\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\nID\tData Source\tData Component\tDetects\nDS0029\tNetwork Traffic\tNetwork Traffic Content\t\n\nMonitor for suspicious network traffic that could be indicative of probing for user information, such as large/iterative quantities of authentication requests originating from a single source (especially if the source is known to be associated with an adversary/botnet). Analyzing web metadata may also reveal artifacts that can be attributed to potentially malicious activity, such as referer or user-agent string HTTP/S fields.\n\nReferences\nGrimHacker. (2017, July 24). Office365 ActiveSync Username Enumeration. Retrieved December 9, 2021.\nCybersecurity Resource Center. (n.d.). CYBERSECURITY INCIDENTS. Retrieved October 20, 2020.\nThomson, I. (2017, September 26). Deloitte is a sitting duck: Key systems with RDP open, VPN and proxy 'login details leaked'. Retrieved October 19, 2020.\nMcCarthy, K. (2015, February 28). FORK ME! Uber hauls GitHub into court to find who hacked database of 50,000 drivers. Retrieved October 19, 2020.\nDetectify. (2016, April 28). Slack bot token leakage exposing business critical information. Retrieved October 19, 2020.\nSandvik, R. (2014, January 14). Attackers Scrape GitHub For Cloud Service Credentials, Hijack Account To Mine Virtual Currency. Retrieved October 19, 2020.\nDylan Ayrey. (2016, December 31). truffleHog. Retrieved October 19, 2020.\nMichael Henriksen. (2018, June 9). Gitrob: Putting the Open Source in OSINT. Retrieved October 19, 2020.\nNg, A. (2019, January 17). Massive breach leaks 773 million email addresses, 21 million passwords. Retrieved October 20, 2020.\nAmnesty International. (2021, February 24). Vietnamese activists targeted by notorious hacking group. Retrieved March 1, 2021.\nTa, V., et al. (2022, August 8). FIN13: A Cybercriminal Threat Actor Focused on Mexico. Retrieved February 9, 2023.\nClearSky Cyber Security . (2021, August). New Iranian Espionage Campaign By “Siamesekitten” - Lyceum. Retrieved June 6, 2022.\nMSTIC, DART, M365 Defender. (2022, March 24). DEV-0537 Criminal Actor Targeting Organizations for Data Exfiltration and Destruction. Retrieved May 17, 2022.\nMiller, J. et al. (2021, July 13). Operation SpoofedScholars: A Conversation with TA453. Retrieved August 18, 2021.\nClearSky Research Team. (2020, August 13). Operation 'Dream Job' Widespread North Korean Espionage Campaign. Retrieved December 20, 2021.\nDantzig, M. v., Schamper, E. (2019, December 19). Operation Wocao: Shining a light on one of China’s hidden hacking groups. Retrieved October 8, 2020.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
},

  {
    "title": "Gather Victim Network Information: Network Security Appliances, Sub-technique T1590.006 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1590/006/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nGather Victim Network Information\nNetwork Security Appliances\nGather Victim Network Information: Network Security Appliances\nOther sub-techniques of Gather Victim Network Information (6)\n\nAdversaries may gather information about the victim's network security appliances that can be used during targeting. Information about network security appliances may include a variety of details, such as the existence and specifics of deployed firewalls, content filters, and proxies/bastion hosts. Adversaries may also target information about victim network-based intrusion detection systems (NIDS) or other appliances related to defensive cybersecurity operations.\n\nAdversaries may gather this information in various ways, such as direct collection actions via Active Scanning or Phishing for Information.[1] Information about network security appliances may also be exposed to adversaries via online or other accessible data sets (ex: Search Victim-Owned Websites). Gathering this information may reveal opportunities for other forms of reconnaissance (ex: Search Open Technical Databases or Search Open Websites/Domains), establishing operational resources (ex: Develop Capabilities or Obtain Capabilities), and/or initial access (ex: External Remote Services).\n\nID: T1590.006\nSub-technique of:  T1590\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.0\nCreated: 02 October 2020\nLast Modified: 15 April 2021\nVersion Permalink\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nNmap. (n.d.). Chapter 10. Detecting and Subverting Firewalls and Intrusion Detection Systems. Retrieved October 20, 2020.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Gather Victim Network Information: IP Addresses, Sub-technique T1590.005 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1590/005/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nGather Victim Network Information\nIP Addresses\nGather Victim Network Information: IP Addresses\nOther sub-techniques of Gather Victim Network Information (6)\n\nAdversaries may gather the victim's IP addresses that can be used during targeting. Public IP addresses may be allocated to organizations by block, or a range of sequential addresses. Information about assigned IP addresses may include a variety of details, such as which IP addresses are in use. IP addresses may also enable an adversary to derive other details about a victim, such as organizational size, physical location(s), Internet service provider, and or where/how their publicly-facing infrastructure is hosted.\n\nAdversaries may gather this information in various ways, such as direct collection actions via Active Scanning or Phishing for Information. Information about assigned IP addresses may also be exposed to adversaries via online or other accessible data sets (ex: Search Open Technical Databases).[1][2][3] Gathering this information may reveal opportunities for other forms of reconnaissance (ex: Active Scanning or Search Open Websites/Domains), establishing operational resources (ex: Acquire Infrastructure or Compromise Infrastructure), and/or initial access (ex: External Remote Services).\n\nID: T1590.005\nSub-technique of:  T1590\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.0\nCreated: 02 October 2020\nLast Modified: 15 April 2021\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nG0138\tAndariel\t\n\nAndariel has limited its watering hole attacks to specific IP address ranges.[4]\n\n\nG0125\tHAFNIUM\t\n\nHAFNIUM has obtained IP addresses for publicly-accessible Exchange servers.[5]\n\n\nG0059\tMagic Hound\t\n\nMagic Hound has captured the IP addresses of visitors to their phishing sites.[6]\n\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nNTT America. (n.d.). Whois Lookup. Retrieved October 20, 2020.\nHacker Target. (n.d.). DNS Dumpster. Retrieved October 20, 2020.\nCIRCL Computer Incident Response Center. (n.d.). Passive DNS. Retrieved October 20, 2020.\nAhnLab. (2018, June 23). Targeted attacks by Andariel Threat Group, a subgroup of the Lazarus. Retrieved September 29, 2021.\nGruzweig, J. et al. (2021, March 2). Operation Exchange Marauder: Active Exploitation of Multiple Zero-Day Microsoft Exchange Vulnerabilities. Retrieved March 3, 2021.\nBash, A. (2021, October 14). Countering threats from Iran. Retrieved January 4, 2023.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Gather Victim Network Information: Network Topology, Sub-technique T1590.004 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1590/004/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nGather Victim Network Information\nNetwork Topology\nGather Victim Network Information: Network Topology\nOther sub-techniques of Gather Victim Network Information (6)\n\nAdversaries may gather information about the victim's network topology that can be used during targeting. Information about network topologies may include a variety of details, including the physical and/or logical arrangement of both external-facing and internal network environments. This information may also include specifics regarding network devices (gateways, routers, etc.) and other infrastructure.\n\nAdversaries may gather this information in various ways, such as direct collection actions via Active Scanning or Phishing for Information. Information about network topologies may also be exposed to adversaries via online or other accessible data sets (ex: Search Victim-Owned Websites).[1] Gathering this information may reveal opportunities for other forms of reconnaissance (ex: Search Open Technical Databases or Search Open Websites/Domains), establishing operational resources (ex: Acquire Infrastructure or Compromise Infrastructure), and/or initial access (ex: External Remote Services).\n\nID: T1590.004\nSub-technique of:  T1590\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.0\nCreated: 02 October 2020\nLast Modified: 15 April 2021\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nG1016\tFIN13\t\n\nFIN13 has searched for infrastructure that can provide remote access to an environment for targeting efforts.[2]\n\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nHacker Target. (n.d.). DNS Dumpster. Retrieved October 20, 2020.\nTa, V., et al. (2022, August 8). FIN13: A Cybercriminal Threat Actor Focused on Mexico. Retrieved February 9, 2023.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Gather Victim Network Information: Network Trust Dependencies, Sub-technique T1590.003 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1590/003/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nGather Victim Network Information\nNetwork Trust Dependencies\nGather Victim Network Information: Network Trust Dependencies\nOther sub-techniques of Gather Victim Network Information (6)\n\nAdversaries may gather information about the victim's network trust dependencies that can be used during targeting. Information about network trusts may include a variety of details, including second or third-party organizations/domains (ex: managed service providers, contractors, etc.) that have connected (and potentially elevated) network access.\n\nAdversaries may gather this information in various ways, such as direct elicitation via Phishing for Information. Information about network trusts may also be exposed to adversaries via online or other accessible data sets (ex: Search Open Technical Databases).[1] Gathering this information may reveal opportunities for other forms of reconnaissance (ex: Active Scanning or Search Open Websites/Domains), establishing operational resources (ex: Acquire Infrastructure or Compromise Infrastructure), and/or initial access (ex: Trusted Relationship).\n\nID: T1590.003\nSub-technique of:  T1590\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.0\nCreated: 02 October 2020\nLast Modified: 15 April 2021\nVersion Permalink\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nGarcía, C. (2019, April 3). Pentesting Active Directory Forests. Retrieved October 20, 2020.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Gather Victim Network Information: DNS, Sub-technique T1590.002 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1590/002/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nGather Victim Network Information\nDNS\nGather Victim Network Information: DNS\nOther sub-techniques of Gather Victim Network Information (6)\n\nAdversaries may gather information about the victim's DNS that can be used during targeting. DNS information may include a variety of details, including registered name servers as well as records that outline addressing for a target’s subdomains, mail servers, and other hosts. DNS, MX, TXT, and SPF records may also reveal the use of third party cloud and SaaS providers, such as Office 365, G Suite, Salesforce, or Zendesk.[1]\n\nAdversaries may gather this information in various ways, such as querying or otherwise collecting details via DNS/Passive DNS. DNS information may also be exposed to adversaries via online or other accessible data sets (ex: Search Open Technical Databases).[2][3] Gathering this information may reveal opportunities for other forms of reconnaissance (ex: Search Open Technical Databases, Search Open Websites/Domains, or Active Scanning), establishing operational resources (ex: Acquire Infrastructure or Compromise Infrastructure), and/or initial access (ex: External Remote Services).\n\nID: T1590.002\nSub-technique of:  T1590\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nContributors: Jannie Li, Microsoft Threat Intelligence Center (MSTIC)\nVersion: 1.1\nCreated: 02 October 2020\nLast Modified: 21 October 2022\nVersion Permalink\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nSean Metcalf. (2019, May 9). Sean Metcalf Twitter. Retrieved May 27, 2022.\nHacker Target. (n.d.). DNS Dumpster. Retrieved October 20, 2020.\nCIRCL Computer Incident Response Center. (n.d.). Passive DNS. Retrieved October 20, 2020.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Gather Victim Network Information: Domain Properties, Sub-technique T1590.001 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1590/001/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nGather Victim Network Information\nDomain Properties\nGather Victim Network Information: Domain Properties\nOther sub-techniques of Gather Victim Network Information (6)\n\nAdversaries may gather information about the victim's network domain(s) that can be used during targeting. Information about domains and their properties may include a variety of details, including what domain(s) the victim owns as well as administrative data (ex: name, registrar, etc.) and more directly actionable information such as contacts (email addresses and phone numbers), business addresses, and name servers.\n\nAdversaries may gather this information in various ways, such as direct collection actions via Active Scanning or Phishing for Information. Information about victim domains and their properties may also be exposed to adversaries via online or other accessible data sets (ex: WHOIS).[1][2][3] Where third-party cloud providers are in use, this information may also be exposed through publicly available API endpoints, such as GetUserRealm and autodiscover in Office 365 environments.[4][5] Gathering this information may reveal opportunities for other forms of reconnaissance (ex: Search Open Technical Databases, Search Open Websites/Domains, or Phishing for Information), establishing operational resources (ex: Acquire Infrastructure or Compromise Infrastructure), and/or initial access (ex: Phishing).\n\nID: T1590.001\nSub-technique of:  T1590\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nContributors: Jannie Li, Microsoft Threat Intelligence Center (MSTIC)\nVersion: 1.1\nCreated: 02 October 2020\nLast Modified: 21 October 2022\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nS0677\tAADInternals\t\n\nAADInternals can gather information about a tenant’s domains using public Microsoft APIs.[6][7]\n\n\nG0034\tSandworm Team\t\n\nSandworm Team conducted technical reconnaissance of the Parliament of Georgia's official internet domain prior to its 2019 attack.[8]\n\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nNTT America. (n.d.). Whois Lookup. Retrieved October 20, 2020.\nHacker Target. (n.d.). DNS Dumpster. Retrieved October 20, 2020.\nCIRCL Computer Incident Response Center. (n.d.). Passive DNS. Retrieved October 20, 2020.\nDr. Nestori Syynimaa. (2020, June 13). Just looking: Azure Active Directory reconnaissance as an outsider. Retrieved May 27, 2022.\nMicrosoft. (2017, January 23). (Cloud) Tip of the Day: Advanced way to check domain availability for Office 365 and Azure. Retrieved May 27, 2022.\nDr. Nestori Syynimaa. (2018, October 25). AADInternals. Retrieved February 18, 2022.\nDr. Nestori Syynimaa. (2020, June 13). Just looking: Azure Active Directory reconnaissance as an outsider. Retrieved February 1, 2022.\nScott W. Brady. (2020, October 15). United States vs. Yuriy Sergeyevich Andrienko et al.. Retrieved November 25, 2020.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Gather Victim Network Information, Technique T1590 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1590/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nGather Victim Network Information\nGather Victim Network Information\nSub-techniques (6)\n\nAdversaries may gather information about the victim's networks that can be used during targeting. Information about networks may include a variety of details, including administrative data (ex: IP ranges, domain names, etc.) as well as specifics regarding its topology and operations.\n\nAdversaries may gather this information in various ways, such as direct collection actions via Active Scanning or Phishing for Information. Information about networks may also be exposed to adversaries via online or other accessible data sets (ex: Search Open Technical Databases).[1][2][3] Gathering this information may reveal opportunities for other forms of reconnaissance (ex: Active Scanning or Search Open Websites/Domains), establishing operational resources (ex: Acquire Infrastructure or Compromise Infrastructure), and/or initial access (ex: Trusted Relationship).\n\nID: T1590\nSub-techniques:  T1590.001, T1590.002, T1590.003, T1590.004, T1590.005, T1590.006\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.0\nCreated: 02 October 2020\nLast Modified: 15 April 2021\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nG0125\tHAFNIUM\t\n\nHAFNIUM gathered the fully qualified domain names (FQDNs) for targeted Exchange servers in the victim's environment.[4]\n\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nNTT America. (n.d.). Whois Lookup. Retrieved October 20, 2020.\nHacker Target. (n.d.). DNS Dumpster. Retrieved October 20, 2020.\nCIRCL Computer Incident Response Center. (n.d.). Passive DNS. Retrieved October 20, 2020.\nGruzweig, J. et al. (2021, March 2). Operation Exchange Marauder: Active Exploitation of Multiple Zero-Day Microsoft Exchange Vulnerabilities. Retrieved March 3, 2021.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  }
,

  {
    "title": "Gather Victim Org Information: Identify Roles, Sub-technique T1591.004 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1591/004/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nGather Victim Org Information\nIdentify Roles\nGather Victim Org Information: Identify Roles\nOther sub-techniques of Gather Victim Org Information (4)\n\nAdversaries may gather information about identities and roles within the victim organization that can be used during targeting. Information about business roles may reveal a variety of targetable details, including identifiable information for key personnel as well as what data/resources they have access to.\n\nAdversaries may gather this information in various ways, such as direct elicitation via Phishing for Information. Information about business roles may also be exposed to adversaries via online or other accessible data sets (ex: Social Media or Search Victim-Owned Websites).[1] Gathering this information may reveal opportunities for other forms of reconnaissance (ex: Phishing for Information or Search Open Websites/Domains), establishing operational resources (ex: Establish Accounts or Compromise Accounts), and/or initial access (ex: Phishing).\n\nID: T1591.004\nSub-technique of:  T1591\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.0\nCreated: 02 October 2020\nLast Modified: 15 April 2021\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nG1001\tHEXANE\t\n\nHEXANE has identified executives, HR, and IT staff at victim organizations for further targeting.[2][3]\n\n\nG1004\tLAPSUS$\t\n\nLAPSUS$ has gathered detailed knowledge of team structures within a target organization.[4]\n\n\nC0022\tOperation Dream Job\t\n\nDuring Operation Dream Job, Lazarus Group targeted specific individuals within an organization with tailored job vacancy announcements.[5][6]\n\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nSeals, T. (2020, October 15). Broadvoice Leak Exposes 350M Records, Personal Voicemail Transcripts. Retrieved October 20, 2020.\nSecureWorks 2019, August 27 LYCEUM Takes Center Stage in Middle East Campaign Retrieved. 2019/11/19\nClearSky Cyber Security . (2021, August). New Iranian Espionage Campaign By “Siamesekitten” - Lyceum. Retrieved June 6, 2022.\nMSTIC, DART, M365 Defender. (2022, March 24). DEV-0537 Criminal Actor Targeting Organizations for Data Exfiltration and Destruction. Retrieved May 17, 2022.\nClearSky Research Team. (2020, August 13). Operation 'Dream Job' Widespread North Korean Espionage Campaign. Retrieved December 20, 2021.\nBreitenbacher, D and Osis, K. (2020, June 17). OPERATION IN(TER)CEPTION: Targeted Attacks Against European Aerospace and Military Companies. Retrieved December 20, 2021.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Gather Victim Org Information: Identify Business Tempo, Sub-technique T1591.003 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1591/003/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nGather Victim Org Information\nIdentify Business Tempo\nGather Victim Org Information: Identify Business Tempo\nOther sub-techniques of Gather Victim Org Information (4)\n\nAdversaries may gather information about the victim's business tempo that can be used during targeting. Information about an organization’s business tempo may include a variety of details, including operational hours/days of the week. This information may also reveal times/dates of purchases and shipments of the victim’s hardware and software resources.\n\nAdversaries may gather this information in various ways, such as direct elicitation via Phishing for Information. Information about business tempo may also be exposed to adversaries via online or other accessible data sets (ex: Social Media or Search Victim-Owned Websites).[1] Gathering this information may reveal opportunities for other forms of reconnaissance (ex: Phishing for Information or Search Open Websites/Domains), establishing operational resources (ex: Establish Accounts or Compromise Accounts), and/or initial access (ex: Supply Chain Compromise or Trusted Relationship)\n\nID: T1591.003\nSub-technique of:  T1591\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.0\nCreated: 02 October 2020\nLast Modified: 15 April 2021\nVersion Permalink\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nSeals, T. (2020, October 15). Broadvoice Leak Exposes 350M Records, Personal Voicemail Transcripts. Retrieved October 20, 2020.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Gather Victim Org Information: Business Relationships, Sub-technique T1591.002 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1591/002/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nGather Victim Org Information\nBusiness Relationships\nGather Victim Org Information: Business Relationships\nOther sub-techniques of Gather Victim Org Information (4)\n\nAdversaries may gather information about the victim's business relationships that can be used during targeting. Information about an organization’s business relationships may include a variety of details, including second or third-party organizations/domains (ex: managed service providers, contractors, etc.) that have connected (and potentially elevated) network access. This information may also reveal supply chains and shipment paths for the victim’s hardware and software resources.\n\nAdversaries may gather this information in various ways, such as direct elicitation via Phishing for Information. Information about business relationships may also be exposed to adversaries via online or other accessible data sets (ex: Social Media or Search Victim-Owned Websites).[1] Gathering this information may reveal opportunities for other forms of reconnaissance (ex: Phishing for Information or Search Open Websites/Domains), establishing operational resources (ex: Establish Accounts or Compromise Accounts), and/or initial access (ex: Supply Chain Compromise, Drive-by Compromise, or Trusted Relationship).\n\nID: T1591.002\nSub-technique of:  T1591\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.0\nCreated: 02 October 2020\nLast Modified: 15 April 2021\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nG0035\tDragonfly\t\n\nDragonfly has collected open source information to identify relationships between organizations for targeting purposes.[2]\n\n\nG1004\tLAPSUS$\t\n\nLAPSUS$ has gathered detailed knowledge of an organization's supply chain relationships.[3]\n\n\nG0034\tSandworm Team\t\n\nIn preparation for its attack against the 2018 Winter Olympics, Sandworm Team conducted online research of partner organizations listed on an official PyeongChang Olympics partnership site.[4]\n\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nSeals, T. (2020, October 15). Broadvoice Leak Exposes 350M Records, Personal Voicemail Transcripts. Retrieved October 20, 2020.\nSlowik, J. (2021, October). THE BAFFLING BERSERK BEAR: A DECADE’S ACTIVITY TARGETING CRITICAL INFRASTRUCTURE. Retrieved December 6, 2021.\nMSTIC, DART, M365 Defender. (2022, March 24). DEV-0537 Criminal Actor Targeting Organizations for Data Exfiltration and Destruction. Retrieved May 17, 2022.\nScott W. Brady. (2020, October 15). United States vs. Yuriy Sergeyevich Andrienko et al.. Retrieved November 25, 2020.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Gather Victim Org Information: Determine Physical Locations, Sub-technique T1591.001 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1591/001/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nGather Victim Org Information\nDetermine Physical Locations\nGather Victim Org Information: Determine Physical Locations\nOther sub-techniques of Gather Victim Org Information (4)\n\nAdversaries may gather the victim's physical location(s) that can be used during targeting. Information about physical locations of a target organization may include a variety of details, including where key resources and infrastructure are housed. Physical locations may also indicate what legal jurisdiction and/or authorities the victim operates within.\n\nAdversaries may gather this information in various ways, such as direct elicitation via Phishing for Information. Physical locations of a target organization may also be exposed to adversaries via online or other accessible data sets (ex: Search Victim-Owned Websites or Social Media).[1][2] Gathering this information may reveal opportunities for other forms of reconnaissance (ex: Phishing for Information or Search Open Websites/Domains), establishing operational resources (ex: Develop Capabilities or Obtain Capabilities), and/or initial access (ex: Phishing or Hardware Additions).\n\nID: T1591.001\nSub-technique of:  T1591\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.1\nCreated: 02 October 2020\nLast Modified: 27 August 2021\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nG0059\tMagic Hound\t\n\nMagic Hound has collected location information from visitors to their phishing sites.[3]\n\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nSeals, T. (2020, October 15). Broadvoice Leak Exposes 350M Records, Personal Voicemail Transcripts. Retrieved October 20, 2020.\nU.S. SEC. (n.d.). EDGAR - Search and Access. Retrieved August 27, 2021.\nBash, A. (2021, October 14). Countering threats from Iran. Retrieved January 4, 2023.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Gather Victim Org Information, Technique T1591 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1591/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nGather Victim Org Information\nGather Victim Org Information\nSub-techniques (4)\n\nAdversaries may gather information about the victim's organization that can be used during targeting. Information about an organization may include a variety of details, including the names of divisions/departments, specifics of business operations, as well as the roles and responsibilities of key employees.\n\nAdversaries may gather this information in various ways, such as direct elicitation via Phishing for Information. Information about an organization may also be exposed to adversaries via online or other accessible data sets (ex: Social Media or Search Victim-Owned Websites).[1][2] Gathering this information may reveal opportunities for other forms of reconnaissance (ex: Phishing for Information or Search Open Websites/Domains), establishing operational resources (ex: Establish Accounts or Compromise Accounts), and/or initial access (ex: Phishing or Trusted Relationship).\n\nID: T1591\nSub-techniques:  T1591.001, T1591.002, T1591.003, T1591.004\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.1\nCreated: 02 October 2020\nLast Modified: 27 August 2021\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nG0094\tKimsuky\t\n\nKimsuky has collected victim organization information including but not limited to organization hierarchy, functions, press releases, and others.[3]\n\n\nG0032\tLazarus Group\t\n\nLazarus Group has studied publicly available information about a targeted organization to tailor spearphishing efforts against specific departments and/or individuals.[4]\n\n\nC0022\tOperation Dream Job\t\n\nFor Operation Dream Job, Lazarus Group gathered victim organization information to identify specific targets.[5]\n\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nSeals, T. (2020, October 15). Broadvoice Leak Exposes 350M Records, Personal Voicemail Transcripts. Retrieved October 20, 2020.\nU.S. SEC. (n.d.). EDGAR - Search and Access. Retrieved August 27, 2021.\nKISA. (n.d.). Phishing Target Reconnaissance and Attack Resource Analysis Operation Muzabi. Retrieved March 7, 2022.\nVyacheslav Kopeytsev and Seongsu Park. (2021, February 25). Lazarus targets defense industry with ThreatNeedle. Retrieved October 27, 2021.\nClearSky Research Team. (2020, August 13). Operation 'Dream Job' Widespread North Korean Espionage Campaign. Retrieved December 20, 2021.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  }
,
  {
    "title": "Gather Victim Host Information: Client Configurations, Sub-technique T1592.004 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1592/004/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nGather Victim Host Information\nClient Configurations\nGather Victim Host Information: Client Configurations\nOther sub-techniques of Gather Victim Host Information (4)\n\nAdversaries may gather information about the victim's client configurations that can be used during targeting. Information about client configurations may include a variety of details and settings, including operating system/version, virtualization, architecture (ex: 32 or 64 bit), language, and/or time zone.\n\nAdversaries may gather this information in various ways, such as direct collection actions via Active Scanning (ex: listening ports, server banners, user agent strings) or Phishing for Information. Adversaries may also compromise sites then include malicious content designed to collect host information from visitors.[1] Information about the client configurations may also be exposed to adversaries via online or other accessible data sets (ex: job postings, network maps, assessment reports, resumes, or purchase invoices). Gathering this information may reveal opportunities for other forms of reconnaissance (ex: Search Open Websites/Domains or Search Open Technical Databases), establishing operational resources (ex: Develop Capabilities or Obtain Capabilities), and/or initial access (ex: Supply Chain Compromise or External Remote Services).\n\nID: T1592.004\nSub-technique of:  T1592\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.1\nCreated: 02 October 2020\nLast Modified: 17 October 2021\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nG0125\tHAFNIUM\t\n\nHAFNIUM has interacted with Office 365 tenants to gather details regarding target's environments.[2]\n\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\nID\tData Source\tData Component\tDetects\nDS0035\tInternet Scan\tResponse Content\t\n\nInternet scanners may be used to look for patterns associated with malicious content designed to collect client configuration information from visitors.[3][1]Much of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders. Detection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nBlasco, J. (2014, August 28). Scanbox: A Reconnaissance Framework Used with Watering Hole Attacks. Retrieved October 19, 2020.\nMSTIC. (2021, March 2). HAFNIUM targeting Exchange Servers with 0-day exploits. Retrieved March 3, 2021.\nThreatConnect. (2020, December 15). Infrastructure Research and Hunting: Boiling the Domain Ocean. Retrieved October 12, 2021.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Gather Victim Host Information: Firmware, Sub-technique T1592.003 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1592/003/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nGather Victim Host Information\nFirmware\nGather Victim Host Information: Firmware\nOther sub-techniques of Gather Victim Host Information (4)\n\nAdversaries may gather information about the victim's host firmware that can be used during targeting. Information about host firmware may include a variety of details such as type and versions on specific hosts, which may be used to infer more information about hosts in the environment (ex: configuration, purpose, age/patch level, etc.).\n\nAdversaries may gather this information in various ways, such as direct elicitation via Phishing for Information. Information about host firmware may only be exposed to adversaries via online or other accessible data sets (ex: job postings, network maps, assessment reports, resumes, or purchase invoices).[1] Gathering this information may reveal opportunities for other forms of reconnaissance (ex: Search Open Websites/Domains or Search Open Technical Databases), establishing operational resources (ex: Develop Capabilities or Obtain Capabilities), and/or initial access (ex: Supply Chain Compromise or Exploit Public-Facing Application).\n\nID: T1592.003\nSub-technique of:  T1592\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.0\nCreated: 02 October 2020\nLast Modified: 15 April 2021\nVersion Permalink\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nGoodin, D. & Salter, J. (2020, August 6). More than 20GB of Intel source code and proprietary data dumped online. Retrieved October 20, 2020.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Gather Victim Host Information: Software, Sub-technique T1592.002 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1592/002/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nGather Victim Host Information\nSoftware\nGather Victim Host Information: Software\nOther sub-techniques of Gather Victim Host Information (4)\n\nAdversaries may gather information about the victim's host software that can be used during targeting. Information about installed software may include a variety of details such as types and versions on specific hosts, as well as the presence of additional components that might be indicative of added defensive protections (ex: antivirus, SIEMs, etc.).\n\nAdversaries may gather this information in various ways, such as direct collection actions via Active Scanning (ex: listening ports, server banners, user agent strings) or Phishing for Information. Adversaries may also compromise sites then include malicious content designed to collect host information from visitors.[1] Information about the installed software may also be exposed to adversaries via online or other accessible data sets (ex: job postings, network maps, assessment reports, resumes, or purchase invoices). Gathering this information may reveal opportunities for other forms of reconnaissance (ex: Search Open Websites/Domains or Search Open Technical Databases), establishing operational resources (ex: Develop Capabilities or Obtain Capabilities), and/or for initial access (ex: Supply Chain Compromise or External Remote Services).\n\nID: T1592.002\nSub-technique of:  T1592\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.1\nCreated: 02 October 2020\nLast Modified: 17 October 2021\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nG0138\tAndariel\t\n\nAndariel has inserted a malicious script within compromised websites to collect potential victim information such as browser type, system language, Flash Player version, and other data.[2]\n\n\nG0059\tMagic Hound\t\n\nMagic Hound has captured the user-agent strings from visitors to their phishing sites.[3]\n\n\nG0034\tSandworm Team\t\n\nSandworm Team has researched software code to enable supply-chain operations, most notably for the 2017 NotPetya attack. Sandworm Team also collected a list of computers using specific software as part of its targeting efforts.[4]\n\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\nID\tData Source\tData Component\tDetects\nDS0035\tInternet Scan\tResponse Content\t\n\nInternet scanners may be used to look for patterns associated with malicious content designed to collect host software information from visitors.[5][1]Much of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders. Detection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nBlasco, J. (2014, August 28). Scanbox: A Reconnaissance Framework Used with Watering Hole Attacks. Retrieved October 19, 2020.\nChen, Joseph. (2018, July 16). New Andariel Reconnaissance Tactics Uncovered. Retrieved September 29, 2021.\nBash, A. (2021, October 14). Countering threats from Iran. Retrieved January 4, 2023.\nScott W. Brady. (2020, October 15). United States vs. Yuriy Sergeyevich Andrienko et al.. Retrieved November 25, 2020.\nThreatConnect. (2020, December 15). Infrastructure Research and Hunting: Boiling the Domain Ocean. Retrieved October 12, 2021.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Gather Victim Host Information: Hardware, Sub-technique T1592.001 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1592/001/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nGather Victim Host Information\nHardware\nGather Victim Host Information: Hardware\nOther sub-techniques of Gather Victim Host Information (4)\n\nAdversaries may gather information about the victim's host hardware that can be used during targeting. Information about hardware infrastructure may include a variety of details such as types and versions on specific hosts, as well as the presence of additional components that might be indicative of added defensive protections (ex: card/biometric readers, dedicated encryption hardware, etc.).\n\nAdversaries may gather this information in various ways, such as direct collection actions via Active Scanning (ex: hostnames, server banners, user agent strings) or Phishing for Information. Adversaries may also compromise sites then include malicious content designed to collect host information from visitors.[1] Information about the hardware infrastructure may also be exposed to adversaries via online or other accessible data sets (ex: job postings, network maps, assessment reports, resumes, or purchase invoices). Gathering this information may reveal opportunities for other forms of reconnaissance (ex: Search Open Websites/Domains or Search Open Technical Databases), establishing operational resources (ex: Develop Capabilities or Obtain Capabilities), and/or initial access (ex: Compromise Hardware Supply Chain or Hardware Additions).\n\nID: T1592.001\nSub-technique of:  T1592\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.1\nCreated: 02 October 2020\nLast Modified: 17 October 2021\nVersion Permalink\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\nID\tData Source\tData Component\tDetects\nDS0035\tInternet Scan\tResponse Content\t\n\nInternet scanners may be used to look for patterns associated with malicious content designed to collect host hardware information from visitors.[2][1]Much of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders. Detection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nBlasco, J. (2014, August 28). Scanbox: A Reconnaissance Framework Used with Watering Hole Attacks. Retrieved October 19, 2020.\nThreatConnect. (2020, December 15). Infrastructure Research and Hunting: Boiling the Domain Ocean. Retrieved October 12, 2021.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Gather Victim Host Information, Technique T1592 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1592/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nGather Victim Host Information\nGather Victim Host Information\nSub-techniques (4)\n\nAdversaries may gather information about the victim's hosts that can be used during targeting. Information about hosts may include a variety of details, including administrative data (ex: name, assigned IP, functionality, etc.) as well as specifics regarding its configuration (ex: operating system, language, etc.).\n\nAdversaries may gather this information in various ways, such as direct collection actions via Active Scanning or Phishing for Information. Adversaries may also compromise sites then include malicious content designed to collect host information from visitors.[1] Information about hosts may also be exposed to adversaries via online or other accessible data sets (ex: Social Media or Search Victim-Owned Websites). Gathering this information may reveal opportunities for other forms of reconnaissance (ex: Search Open Websites/Domains or Search Open Technical Databases), establishing operational resources (ex: Develop Capabilities or Obtain Capabilities), and/or initial access (ex: Supply Chain Compromise or External Remote Services).\n\nID: T1592\nSub-techniques:  T1592.001, T1592.002, T1592.003, T1592.004\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.1\nCreated: 02 October 2020\nLast Modified: 17 October 2021\nVersion Permalink\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\nID\tData Source\tData Component\tDetects\nDS0035\tInternet Scan\tResponse Content\t\n\nInternet scanners may be used to look for patterns associated with malicious content designed to collect host information from visitors.[2][1]Much of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders. Detection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nBlasco, J. (2014, August 28). Scanbox: A Reconnaissance Framework Used with Watering Hole Attacks. Retrieved October 19, 2020.\nThreatConnect. (2020, December 15). Infrastructure Research and Hunting: Boiling the Domain Ocean. Retrieved October 12, 2021.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  }
,
  {
    "title": "Search Open Websites/Domains: Code Repositories, Sub-technique T1593.003 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1593/003/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nSearch Open Websites/Domains\nCode Repositories\nSearch Open Websites/Domains: Code Repositories\nOther sub-techniques of Search Open Websites/Domains (3)\n\nAdversaries may search public code repositories for information about victims that can be used during targeting. Victims may store code in repositories on various third-party websites such as GitHub, GitLab, SourceForge, and BitBucket. Users typically interact with code repositories through a web application or command-line utilities such as git.\n\nAdversaries may search various public code repositories for various information about a victim. Public code repositories can often be a source of various general information about victims, such as commonly used programming languages and libraries as well as the names of employees. Adversaries may also identify more sensitive data, including accidentally leaked credentials or API keys.[1] Information from these sources may reveal opportunities for other forms of reconnaissance (ex: Phishing for Information), establishing operational resources (ex: Compromise Accounts or Compromise Infrastructure), and/or initial access (ex: Valid Accounts or Phishing).\n\nNote: This is distinct from Code Repositories, which focuses on Collection from private and internally hosted code repositories.\n\nID: T1593.003\nSub-technique of:  T1593\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nContributors: Matt Burrough, @mattburrough, Microsoft; Vinayak Wadhwa, SAFE Security\nVersion: 1.0\nCreated: 09 August 2022\nLast Modified: 26 October 2022\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nG1004\tLAPSUS$\t\n\nLAPSUS$ has searched public code repositories for exposed credentials.[2]\n\nMitigations\nID\tMitigation\tDescription\nM1013\tApplication Developer Guidance\t\n\nApplication developers uploading to public code repositories should be careful to avoid publishing sensitive information such as credentials and API keys.\n\n\nM1047\tAudit\t\n\nScan public code repositories for exposed credentials or other sensitive information before making commits. Ensure that any leaked credentials are removed from the commit history, not just the current latest version of the code.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nRuna A. Sandvik. (2014, January 14). Attackers Scrape GitHub For Cloud Service Credentials, Hijack Account To Mine Virtual Currency. Retrieved August 9, 2022.\nMSTIC, DART, M365 Defender. (2022, March 24). DEV-0537 Criminal Actor Targeting Organizations for Data Exfiltration and Destruction. Retrieved May 17, 2022.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Search Open Websites/Domains: Search Engines, Sub-technique T1593.002 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1593/002/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nSearch Open Websites/Domains\nSearch Engines\nSearch Open Websites/Domains: Search Engines\nOther sub-techniques of Search Open Websites/Domains (3)\n\nAdversaries may use search engines to collect information about victims that can be used during targeting. Search engine services typical crawl online sites to index context and may provide users with specialized syntax to search for specific keywords or specific types of content (i.e. filetypes).[1][2]\n\nAdversaries may craft various search engine queries depending on what information they seek to gather. Threat actors may use search engines to harvest general information about victims, as well as use specialized queries to look for spillages/leaks of sensitive information such as network details or credentials. Information from these sources may reveal opportunities for other forms of reconnaissance (ex: Phishing for Information or Search Open Technical Databases), establishing operational resources (ex: Establish Accounts or Compromise Accounts), and/or initial access (ex: Valid Accounts or Phishing).\n\nID: T1593.002\nSub-technique of:  T1593\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.0\nCreated: 02 October 2020\nLast Modified: 15 April 2021\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nG0094\tKimsuky\t\n\nKimsuky has searched for vulnerabilities, tools, and geopolitical trends on Google to target victims.[3]\n\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nBorges, E. (2019, March 5). Exploring Google Hacking Techniques. Retrieved October 20, 2020.\nOffensive Security. (n.d.). Google Hacking Database. Retrieved October 23, 2020.\nKISA. (n.d.). Phishing Target Reconnaissance and Attack Resource Analysis Operation Muzabi. Retrieved March 7, 2022.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Search Open Websites/Domains: Social Media, Sub-technique T1593.001 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1593/001/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nSearch Open Websites/Domains\nSocial Media\nSearch Open Websites/Domains: Social Media\nOther sub-techniques of Search Open Websites/Domains (3)\n\nAdversaries may search social media for information about victims that can be used during targeting. Social media sites may contain various information about a victim organization, such as business announcements as well as information about the roles, locations, and interests of staff.\n\nAdversaries may search in different social media sites depending on what information they seek to gather. Threat actors may passively harvest data from these sites, as well as use information gathered to create fake profiles/groups to elicit victim’s into revealing specific information (i.e. Spearphishing Service).[1] Information from these sources may reveal opportunities for other forms of reconnaissance (ex: Phishing for Information or Search Open Technical Databases), establishing operational resources (ex: Establish Accounts or Compromise Accounts), and/or initial access (ex: Spearphishing via Service).\n\nID: T1593.001\nSub-technique of:  T1593\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.0\nCreated: 02 October 2020\nLast Modified: 15 April 2021\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nG1011\tEXOTIC LILY\t\n\nEXOTIC LILY has copied data from social media sites to impersonate targeted individuals.[2]\n\n\nG0094\tKimsuky\t\n\nKimsuky has used Twitter to monitor potential victims and to prepare targeted phishing e-mails.[3]\n\n\nC0022\tOperation Dream Job\t\n\nFor Operation Dream Job, Lazarus Group used LinkedIn to identify and target employees within a chosen organization.[4]\n\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nCyware Hacker News. (2019, October 2). How Hackers Exploit Social Media To Break Into Your Company. Retrieved October 20, 2020.\nStolyarov, V. (2022, March 17). Exposing initial access broker with ties to Conti. Retrieved August 18, 2022.\nJazi, H. (2021, June 1). Kimsuky APT continues to target South Korean government using AppleSeed backdoor. Retrieved June 10, 2021.\nBreitenbacher, D and Osis, K. (2020, June 17). OPERATION IN(TER)CEPTION: Targeted Attacks Against European Aerospace and Military Companies. Retrieved December 20, 2021.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Search Open Websites/Domains, Technique T1593 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1593/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nSearch Open Websites/Domains\nSearch Open Websites/Domains\nSub-techniques (3)\n\nAdversaries may search freely available websites and/or domains for information about victims that can be used during targeting. Information about victims may be available in various online sites, such as social media, new sites, or those hosting information about business operations such as hiring or requested/rewarded contracts.[1][2][3]\n\nAdversaries may search in different online sites depending on what information they seek to gather. Information from these sources may reveal opportunities for other forms of reconnaissance (ex: Phishing for Information or Search Open Technical Databases), establishing operational resources (ex: Establish Accounts or Compromise Accounts), and/or initial access (ex: External Remote Services or Phishing).\n\nID: T1593\nSub-techniques:  T1593.001, T1593.002, T1593.003\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.1\nCreated: 02 October 2020\nLast Modified: 18 October 2022\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nG0034\tSandworm Team\t\n\nSandworm Team researched Ukraine's unique legal entity identifier (called an \"EDRPOU\" number), including running queries on the EDRPOU website, in preparation for the NotPetya attack. Sandworm Team has also researched third-party websites to help it craft credible spearphishing emails.[4]\n\nMitigations\nID\tMitigation\tDescription\nM1013\tApplication Developer Guidance\t\n\nApplication developers uploading to public code repositories should be careful to avoid publishing sensitive information such as credentials and API keys.\n\n\nM1047\tAudit\t\n\nScan public code repositories for exposed credentials or other sensitive information before making commits. Ensure that any leaked credentials are removed from the commit history, not just the current latest version of the code.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nCyware Hacker News. (2019, October 2). How Hackers Exploit Social Media To Break Into Your Company. Retrieved October 20, 2020.\nBorges, E. (2019, March 5). Exploring Google Hacking Techniques. Retrieved October 20, 2020.\nOffensive Security. (n.d.). Google Hacking Database. Retrieved October 23, 2020.\nScott W. Brady. (2020, October 15). United States vs. Yuriy Sergeyevich Andrienko et al.. Retrieved November 25, 2020.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  }
,
  {
    "title": "Search Victim-Owned Websites, Technique T1594 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1594/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nSearch Victim-Owned Websites\nSearch Victim-Owned Websites\n\nAdversaries may search websites owned by the victim for information that can be used during targeting. Victim-owned websites may contain a variety of details, including names of departments/divisions, physical locations, and data about key employees such as names, roles, and contact info (ex: Email Addresses). These sites may also have details highlighting business operations and relationships.[1]\n\nAdversaries may search victim-owned websites to gather actionable information. Information from these sources may reveal opportunities for other forms of reconnaissance (ex: Phishing for Information or Search Open Technical Databases), establishing operational resources (ex: Establish Accounts or Compromise Accounts), and/or initial access (ex: Trusted Relationship or Phishing).\n\nID: T1594\nSub-techniques:  No sub-techniques\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.0\nCreated: 02 October 2020\nLast Modified: 15 April 2021\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nG1011\tEXOTIC LILY\t\n\nEXOTIC LILY has used contact forms on victim websites to generate phishing e-mails.[2]\n\n\nG0094\tKimsuky\t\n\nKimsuky has searched for information on the target company's website.[3]\n\n\nG0034\tSandworm Team\t\n\nSandworm Team has conducted research against potential victim websites as part of its operational planning.[4]\n\n\nG0122\tSilent Librarian\t\n\nSilent Librarian has searched victim's websites to identify the interests and academic areas of targeted individuals and to scrape source code, branding, and organizational contact information for phishing pages.[5][6][7]\n\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\nID\tData Source\tData Component\tDetects\nDS0015\tApplication Log\tApplication Log Content\t\n\nMonitor for suspicious network traffic that could be indicative of adversary reconnaissance, such as rapid successions of requests indicative of web crawling and/or large quantities of requests originating from a single source (especially if the source is known to be associated with an adversary). Analyzing web metadata may also reveal artifacts that can be attributed to potentially malicious activity, such as referer or user-agent string HTTP/S fields.\n\nReferences\nBischoff, P. (2020, October 15). Broadvoice database of more than 350 million customer records exposed online. Retrieved October 20, 2020.\nStolyarov, V. (2022, March 17). Exposing initial access broker with ties to Conti. Retrieved August 18, 2022.\nKISA. (n.d.). Phishing Target Reconnaissance and Attack Resource Analysis Operation Muzabi. Retrieved March 7, 2022.\nScott W. Brady. (2020, October 15). United States vs. Yuriy Sergeyevich Andrienko et al.. Retrieved November 25, 2020.\nDOJ. (2018, March 23). U.S. v. Rafatnejad et al . Retrieved February 3, 2021.\nHassold, Crane. (2018, March 26). Silent Librarian: More to the Story of the Iranian Mabna Institute Indictment. Retrieved February 3, 2021.\nProofpoint Threat Insight Team. (2019, September 5). Threat Actor Profile: TA407, the Silent Librarian. Retrieved February 3, 2021.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  }
,

  {
    "title": "Active Scanning: Wordlist Scanning, Sub-technique T1595.003 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1595/003/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nActive Scanning\nWordlist Scanning\nActive Scanning: Wordlist Scanning\nOther sub-techniques of Active Scanning (3)\n\nAdversaries may iteratively probe infrastructure using brute-forcing and crawling techniques. While this technique employs similar methods to Brute Force, its goal is the identification of content and infrastructure rather than the discovery of valid credentials. Wordlists used in these scans may contain generic, commonly used names and file extensions or terms specific to a particular software. Adversaries may also create custom, target-specific wordlists using data gathered from other Reconnaissance techniques (ex: Gather Victim Org Information, or Search Victim-Owned Websites).\n\nFor example, adversaries may use web content discovery tools such as Dirb, DirBuster, and GoBuster and generic or custom wordlists to enumerate a website’s pages and directories.[1] This can help them to discover old, vulnerable pages or hidden administrative portals that could become the target of further operations (ex: Exploit Public-Facing Application or Brute Force).\n\nAs cloud storage solutions typically use globally unique names, adversaries may also use target-specific wordlists and tools such as s3recon and GCPBucketBrute to enumerate public and private buckets on cloud infrastructure.[2][3] Once storage objects are discovered, adversaries may leverage Data from Cloud Storage to access valuable information that can be exfiltrated or used to escalate privileges and move laterally.\n\nID: T1595.003\nSub-technique of:  T1595\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nContributors: Elvis Veliz, Citi; Jan Petrov, Citi; Richard Julian, Citi\nVersion: 1.0\nCreated: 04 March 2022\nLast Modified: 15 April 2022\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nG0123\tVolatile Cedar\t\n\nVolatile Cedar has used DirBuster and GoBuster to brute force web directories and DNS subdomains.[1]\n\nMitigations\nID\tMitigation\tDescription\nM1042\tDisable or Remove Feature or Program\t\n\nRemove or disable access to any systems, resources, and infrastructure that are not explicitly required to be available externally.\n\n\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\nID\tData Source\tData Component\tDetects\nDS0029\tNetwork Traffic\tNetwork Traffic Content\t\n\nMonitor for suspicious network traffic that could be indicative of scanning, such as large quantities originating from a single source (especially if the source is known to be associated with an adversary/botnet).\n\nReferences\nClearSky Cyber Security. (2021, January). “Lebanese Cedar” APT Global Lebanese Espionage Campaign Leveraging Web Servers. Retrieved February 10, 2021.\nTravis Clarke. (2020, March 21). S3Recon GitHub. Retrieved March 4, 2022.\nSpencer Gietzen. (2019, February 26). Google Cloud Platform (GCP) Bucket Enumeration and Privilege Escalation. Retrieved March 4, 2022.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Active Scanning: Scanning IP Blocks, Sub-technique T1595.001 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1595/001/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nActive Scanning\nScanning IP Blocks\nActive Scanning: Scanning IP Blocks\nOther sub-techniques of Active Scanning (3)\n\nAdversaries may scan victim IP blocks to gather information that can be used during targeting. Public IP addresses may be allocated to organizations by block, or a range of sequential addresses.\n\nAdversaries may scan IP blocks in order to Gather Victim Network Information, such as which IP addresses are actively in use as well as more detailed information about hosts assigned these addresses. Scans may range from simple pings (ICMP requests and responses) to more nuanced scans that may reveal host software/versions via server banners or other network artifacts.[1] Information from these scans may reveal opportunities for other forms of reconnaissance (ex: Search Open Websites/Domains or Search Open Technical Databases), establishing operational resources (ex: Develop Capabilities or Obtain Capabilities), and/or initial access (ex: External Remote Services).\n\nID: T1595.001\nSub-technique of:  T1595\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.0\nCreated: 02 October 2020\nLast Modified: 15 April 2021\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nG0139\tTeamTNT\t\n\nTeamTNT has scanned specific lists of target IP addresses.[2]\n\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\nID\tData Source\tData Component\tDetects\nDS0029\tNetwork Traffic\tNetwork Traffic Flow\t\n\nMonitor network data for uncommon data flows. Processes utilizing the network that do not normally have network communication or have never been seen before are suspicious.\n\nReferences\nDainotti, A. et al. (2012). Analysis of a “/0” Stealth Scan from a Botnet. Retrieved October 20, 2020.\nFiser, D. Oliveira, A. (n.d.). Tracking the Activities of TeamTNT A Closer Look at a Cloud-Focused Malicious Actor Group. Retrieved September 22, 2021.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Active Scanning: Vulnerability Scanning, Sub-technique T1595.002 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1595/002/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nActive Scanning\nVulnerability Scanning\nActive Scanning: Vulnerability Scanning\nOther sub-techniques of Active Scanning (3)\n\nAdversaries may scan victims for vulnerabilities that can be used during targeting. Vulnerability scans typically check if the configuration of a target host/application (ex: software and version) potentially aligns with the target of a specific exploit the adversary may seek to use.\n\nThese scans may also include more broad attempts to Gather Victim Host Information that can be used to identify more commonly known, exploitable vulnerabilities. Vulnerability scans typically harvest running software and version numbers via server banners, listening ports, or other network artifacts.[1] Information from these scans may reveal opportunities for other forms of reconnaissance (ex: Search Open Websites/Domains or Search Open Technical Databases), establishing operational resources (ex: Develop Capabilities or Obtain Capabilities), and/or initial access (ex: Exploit Public-Facing Application).\n\nID: T1595.002\nSub-technique of:  T1595\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.0\nCreated: 02 October 2020\nLast Modified: 13 March 2023\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nG0007\tAPT28\t\n\nAPT28 has performed large-scale scans in an attempt to find vulnerable servers.[2]\n\n\nG0016\tAPT29\t\n\nAPT29 has conducted widespread scanning of target environments to identify vulnerabilities for exploit.[3]\n\n\nG0143\tAquatic Panda\t\n\nAquatic Panda has used publicly accessible DNS logging services to identify servers vulnerable to Log4j (CVE 2021-44228).[4]\n\n\nG0035\tDragonfly\t\n\nDragonfly has scanned targeted systems for vulnerable Citrix and Microsoft Exchange services.[5]\n\n\nG1006\tEarth Lusca\t\n\nEarth Lusca has scanned for vulnerabilities in the public-facing servers of their targets.[6]\n\n\nG0059\tMagic Hound\t\n\nMagic Hound has conducted widespread scanning to identify public-facing systems vulnerable to CVE-2021-44228 in Log4j and ProxyShell vulnerabilities; CVE-2021-26855, CVE-2021-26857, CVE-2021-26858, and CVE-2021-27065 in on-premises MS Exchange Servers; and CVE-2018-13379 in Fortinet FortiOS SSL VPNs.[7][8]\n\n\nG0034\tSandworm Team\t\n\nSandworm Team has scanned network infrastructure for vulnerabilities as part of its operational planning.[9]\n\n\nG0139\tTeamTNT\t\n\nTeamTNT has scanned for vulnerabilities in IoT devices and other related resources such as the Docker API.[10]\n\n\nG0123\tVolatile Cedar\t\n\nVolatile Cedar has performed vulnerability scans of the target server.[11][12]\n\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\nID\tData Source\tData Component\tDetects\nDS0029\tNetwork Traffic\tNetwork Traffic Content\t\n\nMonitor and analyze traffic patterns and packet inspection associated to protocol(s) that do not follow the expected protocol standards and traffic flows (e.g extraneous packets that do not belong to established flows, gratuitous or anomalous traffic patterns, anomalous syntax, or structure). Consider correlation with process monitoring and command line to detect anomalous processes execution and command line arguments associated to traffic patterns (e.g. monitor anomalies in use of files that do not normally initiate connections for respective protocol(s)).\n\n\n\t\tNetwork Traffic Flow\t\n\nMonitor network data for uncommon data flows. Processes utilizing the network that do not normally have network communication or have never been seen before are suspicious.\n\nReferences\nOWASP. (n.d.). OAT-014 Vulnerability Scanning. Retrieved October 20, 2020.\nHacquebord, F. (n.d.). Pawn Storm in 2019 A Year of Scanning and Credential Phishing on High-Profile Targets. Retrieved December 29, 2020.\nNCSC, CISA, FBI, NSA. (2021, May 7). Further TTPs associated with SVR cyber actors. Retrieved July 29, 2021.\nWiley, B. et al. (2021, December 29). OverWatch Exposes AQUATIC PANDA in Possession of Log4Shell Exploit Tools During Hands-on Intrusion Attempt. Retrieved January 18, 2022.\nCISA. (2020, December 1). Russian State-Sponsored Advanced Persistent Threat Actor Compromises U.S. Government Targets. Retrieved December 9, 2021.\nChen, J., et al. (2022). Delving Deep: An Analysis of Earth Lusca’s Operations. Retrieved July 1, 2022.\nCheck Point. (2022, January 11). APT35 exploits Log4j vulnerability to distribute new modular PowerShell toolkit. Retrieved January 24, 2022.\nMSTIC. (2021, November 16). Evolving trends in Iranian threat actor activity – MSTIC presentation at CyberWarCon 2021. Retrieved January 12, 2023.\nScott W. Brady. (2020, October 15). United States vs. Yuriy Sergeyevich Andrienko et al.. Retrieved November 25, 2020.\nFiser, D. Oliveira, A. (n.d.). Tracking the Activities of TeamTNT A Closer Look at a Cloud-Focused Malicious Actor Group. Retrieved September 22, 2021.\nThreat Intelligence and Research. (2015, March 30). VOLATILE CEDAR. Retrieved February 8, 2021.\nClearSky Cyber Security. (2021, January). “Lebanese Cedar” APT Global Lebanese Espionage Campaign Leveraging Web Servers. Retrieved February 10, 2021.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Active Scanning, Technique T1595 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1595/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nActive Scanning\nActive Scanning\nSub-techniques (3)\n\nAdversaries may execute active reconnaissance scans to gather information that can be used during targeting. Active scans are those where the adversary probes victim infrastructure via network traffic, as opposed to other forms of reconnaissance that do not involve direct interaction.\n\nAdversaries may perform different forms of active scanning depending on what information they seek to gather. These scans can also be performed in various ways, including using native features of network protocols such as ICMP.[1][2] Information from these scans may reveal opportunities for other forms of reconnaissance (ex: Search Open Websites/Domains or Search Open Technical Databases), establishing operational resources (ex: Develop Capabilities or Obtain Capabilities), and/or initial access (ex: External Remote Services or Exploit Public-Facing Application).\n\nID: T1595\nSub-techniques:  T1595.001, T1595.002, T1595.003\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.0\nCreated: 02 October 2020\nLast Modified: 08 March 2022\nVersion Permalink\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\nID\tData Source\tData Component\tDetects\nDS0029\tNetwork Traffic\tNetwork Traffic Content\t\n\nMonitor and analyze traffic patterns and packet inspection associated to protocol(s) that do not follow the expected protocol standards and traffic flows (e.g extraneous packets that do not belong to established flows, gratuitous or anomalous traffic patterns, anomalous syntax, or structure). Consider correlation with process monitoring and command line to detect anomalous processes execution and command line arguments associated to traffic patterns (e.g. monitor anomalies in use of files that do not normally initiate connections for respective protocol(s)).\n\n\n\t\tNetwork Traffic Flow\t\n\nMonitor network data for uncommon data flows. Processes utilizing the network that do not normally have network communication or have never been seen before are suspicious.\n\nReferences\nDainotti, A. et al. (2012). Analysis of a “/0” Stealth Scan from a Botnet. Retrieved October 20, 2020.\nOWASP Wiki. (2018, February 16). OAT-004 Fingerprinting. Retrieved October 20, 2020.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  }
,
  {
    "title": "Search Open Technical Databases: Scan Databases, Sub-technique T1596.005 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1596/005/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nSearch Open Technical Databases\nScan Databases\nSearch Open Technical Databases: Scan Databases\nOther sub-techniques of Search Open Technical Databases (5)\n\nAdversaries may search within public scan databases for information about victims that can be used during targeting. Various online services continuously publish the results of Internet scans/surveys, often harvesting information such as active IP addresses, hostnames, open ports, certificates, and even server banners.[1]\n\nAdversaries may search scan databases to gather actionable information. Threat actors can use online resources and lookup tools to harvest information from these services. Adversaries may seek information about their already identified targets, or use these datasets to discover opportunities for successful breaches. Information from these sources may reveal opportunities for other forms of reconnaissance (ex: Active Scanning or Search Open Websites/Domains), establishing operational resources (ex: Develop Capabilities or Obtain Capabilities), and/or initial access (ex: External Remote Services or Exploit Public-Facing Application).\n\nID: T1596.005\nSub-technique of:  T1596\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.0\nCreated: 02 October 2020\nLast Modified: 15 April 2021\nVersion Permalink\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nShodan. (n.d.). Shodan. Retrieved October 20, 2020.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Search Open Technical Databases: CDNs, Sub-technique T1596.004 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1596/004/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nSearch Open Technical Databases\nCDNs\nSearch Open Technical Databases: CDNs\nOther sub-techniques of Search Open Technical Databases (5)\n\nAdversaries may search content delivery network (CDN) data about victims that can be used during targeting. CDNs allow an organization to host content from a distributed, load balanced array of servers. CDNs may also allow organizations to customize content delivery based on the requestor’s geographical region.\n\nAdversaries may search CDN data to gather actionable information. Threat actors can use online resources and lookup tools to harvest information about content servers within a CDN. Adversaries may also seek and target CDN misconfigurations that leak sensitive information not intended to be hosted and/or do not have the same protection mechanisms (ex: login portals) as the content hosted on the organization’s website.[1] Information from these sources may reveal opportunities for other forms of reconnaissance (ex: Active Scanning or Search Open Websites/Domains), establishing operational resources (ex: Acquire Infrastructure or Compromise Infrastructure), and/or initial access (ex: Drive-by Compromise).\n\nID: T1596.004\nSub-technique of:  T1596\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.0\nCreated: 02 October 2020\nLast Modified: 15 April 2021\nVersion Permalink\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nSwisscom & Digital Shadows. (2017, September 6). Content Delivery Networks (CDNs) Can Leave You Exposed – How You Might Be Affected And What You Can Do About It. Retrieved October 20, 2020.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Search Open Technical Databases: Digital Certificates, Sub-technique T1596.003 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1596/003/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nSearch Open Technical Databases\nDigital Certificates\nSearch Open Technical Databases: Digital Certificates\nOther sub-techniques of Search Open Technical Databases (5)\n\nAdversaries may search public digital certificate data for information about victims that can be used during targeting. Digital certificates are issued by a certificate authority (CA) in order to cryptographically verify the origin of signed content. These certificates, such as those used for encrypted web traffic (HTTPS SSL/TLS communications), contain information about the registered organization such as name and location.\n\nAdversaries may search digital certificate data to gather actionable information. Threat actors can use online resources and lookup tools to harvest information about certificates.[1] Digital certificate data may also be available from artifacts signed by the organization (ex: certificates used from encrypted web traffic are served with content).[2] Information from these sources may reveal opportunities for other forms of reconnaissance (ex: Active Scanning or Phishing for Information), establishing operational resources (ex: Develop Capabilities or Obtain Capabilities), and/or initial access (ex: External Remote Services or Trusted Relationship).\n\nID: T1596.003\nSub-technique of:  T1596\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.0\nCreated: 02 October 2020\nLast Modified: 15 April 2021\nVersion Permalink\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nSSL Shopper. (n.d.). SSL Checker. Retrieved October 20, 2020.\nJain, M. (2019, September 16). Export & Download — SSL Certificate from Server (Site URL). Retrieved October 20, 2020.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Search Open Technical Databases: WHOIS, Sub-technique T1596.002 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1596/002/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nSearch Open Technical Databases\nWHOIS\nSearch Open Technical Databases: WHOIS\nOther sub-techniques of Search Open Technical Databases (5)\n\nAdversaries may search public WHOIS data for information about victims that can be used during targeting. WHOIS data is stored by regional Internet registries (RIR) responsible for allocating and assigning Internet resources such as domain names. Anyone can query WHOIS servers for information about a registered domain, such as assigned IP blocks, contact information, and DNS nameservers.[1]\n\nAdversaries may search WHOIS data to gather actionable information. Threat actors can use online resources or command-line utilities to pillage through WHOIS data for information about potential victims. Information from these sources may reveal opportunities for other forms of reconnaissance (ex: Active Scanning or Phishing for Information), establishing operational resources (ex: Acquire Infrastructure or Compromise Infrastructure), and/or initial access (ex: External Remote Services or Trusted Relationship).\n\nID: T1596.002\nSub-technique of:  T1596\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.0\nCreated: 02 October 2020\nLast Modified: 15 April 2021\nVersion Permalink\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nNTT America. (n.d.). Whois Lookup. Retrieved October 20, 2020.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Search Open Technical Databases: DNS/Passive DNS, Sub-technique T1596.001 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1596/001/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nSearch Open Technical Databases\nDNS/Passive DNS\nSearch Open Technical Databases: DNS/Passive DNS\nOther sub-techniques of Search Open Technical Databases (5)\n\nAdversaries may search DNS data for information about victims that can be used during targeting. DNS information may include a variety of details, including registered name servers as well as records that outline addressing for a target’s subdomains, mail servers, and other hosts.\n\nAdversaries may search DNS data to gather actionable information. Threat actors can query nameservers for a target organization directly, or search through centralized repositories of logged DNS query responses (known as passive DNS).[1][2] Adversaries may also seek and target DNS misconfigurations/leaks that reveal information about internal networks. Information from these sources may reveal opportunities for other forms of reconnaissance (ex: Search Victim-Owned Websites or Search Open Websites/Domains), establishing operational resources (ex: Acquire Infrastructure or Compromise Infrastructure), and/or initial access (ex: External Remote Services or Trusted Relationship).\n\nID: T1596.001\nSub-technique of:  T1596\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.0\nCreated: 02 October 2020\nLast Modified: 15 April 2021\nVersion Permalink\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nHacker Target. (n.d.). DNS Dumpster. Retrieved October 20, 2020.\nCIRCL Computer Incident Response Center. (n.d.). Passive DNS. Retrieved October 20, 2020.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Search Open Technical Databases, Technique T1596 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1596/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nSearch Open Technical Databases\nSearch Open Technical Databases\nSub-techniques (5)\n\nAdversaries may search freely available technical databases for information about victims that can be used during targeting. Information about victims may be available in online databases and repositories, such as registrations of domains/certificates as well as public collections of network data/artifacts gathered from traffic and/or scans.[1][2][3][4][5][6][7]\n\nAdversaries may search in different open databases depending on what information they seek to gather. Information from these sources may reveal opportunities for other forms of reconnaissance (ex: Phishing for Information or Search Open Websites/Domains), establishing operational resources (ex: Acquire Infrastructure or Compromise Infrastructure), and/or initial access (ex: External Remote Services or Trusted Relationship).\n\nID: T1596\nSub-techniques:  T1596.001, T1596.002, T1596.003, T1596.004, T1596.005\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.0\nCreated: 02 October 2020\nLast Modified: 18 October 2022\nVersion Permalink\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nNTT America. (n.d.). Whois Lookup. Retrieved October 20, 2020.\nHacker Target. (n.d.). DNS Dumpster. Retrieved October 20, 2020.\nCIRCL Computer Incident Response Center. (n.d.). Passive DNS. Retrieved October 20, 2020.\nJain, M. (2019, September 16). Export & Download — SSL Certificate from Server (Site URL). Retrieved October 20, 2020.\nSSL Shopper. (n.d.). SSL Checker. Retrieved October 20, 2020.\nSwisscom & Digital Shadows. (2017, September 6). Content Delivery Networks (CDNs) Can Leave You Exposed – How You Might Be Affected And What You Can Do About It. Retrieved October 20, 2020.\nShodan. (n.d.). Shodan. Retrieved October 20, 2020.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  }
,
  {
    "title": "Search Closed Sources: Threat Intel Vendors, Sub-technique T1597.001 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1597/001/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nSearch Closed Sources\nThreat Intel Vendors\nSearch Closed Sources: Threat Intel Vendors\nOther sub-techniques of Search Closed Sources (2)\n\nAdversaries may search private data from threat intelligence vendors for information that can be used during targeting. Threat intelligence vendors may offer paid feeds or portals that offer more data than what is publicly reported. Although sensitive details (such as customer names and other identifiers) may be redacted, this information may contain trends regarding breaches such as target industries, attribution claims, and successful TTPs/countermeasures.[1]\n\nAdversaries may search in private threat intelligence vendor data to gather actionable information. Threat actors may seek information/indicators gathered about their own campaigns, as well as those conducted by other adversaries that may align with their target industries, capabilities/objectives, or other operational concerns. Information reported by vendors may also reveal opportunities other forms of reconnaissance (ex: Search Open Websites/Domains), establishing operational resources (ex: Develop Capabilities or Obtain Capabilities), and/or initial access (ex: Exploit Public-Facing Application or External Remote Services).\n\nID: T1597.001\nSub-technique of:  T1597\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.0\nCreated: 02 October 2020\nLast Modified: 15 April 2021\nVersion Permalink\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nBanerd, W. (2019, April 30). 10 of the Best Open Source Threat Intelligence Feeds. Retrieved October 20, 2020.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Search Closed Sources: Purchase Technical Data, Sub-technique T1597.002 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1597/002/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nSearch Closed Sources\nPurchase Technical Data\nSearch Closed Sources: Purchase Technical Data\nOther sub-techniques of Search Closed Sources (2)\n\nAdversaries may purchase technical information about victims that can be used during targeting. Information about victims may be available for purchase within reputable private sources and databases, such as paid subscriptions to feeds of scan databases or other data aggregation services. Adversaries may also purchase information from less-reputable sources such as dark web or cybercrime blackmarkets.\n\nAdversaries may purchase information about their already identified targets, or use purchased data to discover opportunities for successful breaches. Threat actors may gather various technical details from purchased data, including but not limited to employee contact information, credentials, or specifics regarding a victim’s infrastructure.[1] Information from these sources may reveal opportunities for other forms of reconnaissance (ex: Phishing for Information or Search Open Websites/Domains), establishing operational resources (ex: Develop Capabilities or Obtain Capabilities), and/or initial access (ex: External Remote Services or Valid Accounts).\n\nID: T1597.002\nSub-technique of:  T1597\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.0\nCreated: 02 October 2020\nLast Modified: 15 April 2021\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nG1004\tLAPSUS$\t\n\nLAPSUS$ has purchased credentials and session tokens from criminal underground forums.[2]\n\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nCimpanu, C. (2020, May 9). A hacker group is selling more than 73 million user records on the dark web. Retrieved October 20, 2020.\nMSTIC, DART, M365 Defender. (2022, March 24). DEV-0537 Criminal Actor Targeting Organizations for Data Exfiltration and Destruction. Retrieved May 17, 2022.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Search Closed Sources, Technique T1597 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1597/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nSearch Closed Sources\nSearch Closed Sources\nSub-techniques (2)\n\nAdversaries may search and gather information about victims from closed sources that can be used during targeting. Information about victims may be available for purchase from reputable private sources and databases, such as paid subscriptions to feeds of technical/threat intelligence data.[1] Adversaries may also purchase information from less-reputable sources such as dark web or cybercrime blackmarkets.[2]\n\nAdversaries may search in different closed databases depending on what information they seek to gather. Information from these sources may reveal opportunities for other forms of reconnaissance (ex: Phishing for Information or Search Open Websites/Domains), establishing operational resources (ex: Develop Capabilities or Obtain Capabilities), and/or initial access (ex: External Remote Services or Valid Accounts).\n\nID: T1597\nSub-techniques:  T1597.001, T1597.002\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.0\nCreated: 02 October 2020\nLast Modified: 15 April 2021\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nG1011\tEXOTIC LILY\t\n\nEXOTIC LILY has searched for information on targeted individuals on business databases including RocketReach and CrunchBase.[3]\n\nMitigations\nID\tMitigation\tDescription\nM1056\tPre-compromise\t\n\nThis technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls. Efforts should focus on minimizing the amount and sensitivity of data available to external parties.\n\nDetection\n\nMuch of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.\n\nDetection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\nReferences\nBanerd, W. (2019, April 30). 10 of the Best Open Source Threat Intelligence Feeds. Retrieved October 20, 2020.\nCimpanu, C. (2020, May 9). A hacker group is selling more than 73 million user records on the dark web. Retrieved October 20, 2020.\nStolyarov, V. (2022, March 17). Exposing initial access broker with ties to Conti. Retrieved August 18, 2022.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  }
,
  {
    "title": "Phishing for Information: Spearphishing Voice, Sub-technique T1598.004 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1598/004/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nPhishing for Information\nSpearphishing Voice\nPhishing for Information: Spearphishing Voice\nOther sub-techniques of Phishing for Information (4)\n\nAdversaries may use voice communications to elicit sensitive information that can be used during targeting. Spearphishing for information is an attempt to trick targets into divulging information, frequently credentials or other actionable information. Spearphishing for information frequently involves social engineering techniques, such as posing as a source with a reason to collect information (ex: Impersonation) and/or creating a sense of urgency or alarm for the recipient.\n\nAll forms of phishing are electronically delivered social engineering. In this scenario, adversaries use phone calls to elicit sensitive information from victims. Known as voice phishing (or \"vishing\"), these communications can be manually executed by adversaries, hired call centers, or even automated via robocalls. Voice phishers may spoof their phone number while also posing as a trusted entity, such as a business partner or technical support staff.[1]\n\nVictims may also receive phishing messages that direct them to call a phone number (\"callback phishing\") where the adversary attempts to collect confidential information.[2]\n\nAdversaries may also use information from previous reconnaissance efforts (ex: Search Open Websites/Domains or Search Victim-Owned Websites) to tailor pretexts to be even more persuasive and believable for the victim.\n\nID: T1598.004\nSub-technique of:  T1598\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nVersion: 1.0\nCreated: 07 September 2023\nLast Modified: 08 September 2023\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nC0027\tC0027\t\n\nDuring C0027, Scattered Spider used phone calls to instruct victims to navigate to credential-harvesting websites.[3]\n\n\nG1004\tLAPSUS$\t\n\nLAPSUS$ has called victims' help desk to convince the support personnel to reset a privileged account’s credentials.[4]\n\nMitigations\nID\tMitigation\tDescription\nM1017\tUser Training\t\n\nUsers can be trained to identify and report social engineering techniques and spearphishing attempts, while also being suspicious of and verifying the identify of callers.[5]\n\nDetection\nID\tData Source\tData Component\tDetects\nDS0015\tApplication Log\tApplication Log Content\t\n\nMonitor call logs from corporate devices to identify patterns of potential voice phishing, such as calls to/from known malicious phone numbers.\n\nReferences\nBank of America. (n.d.). How to avoid telephone scams. Retrieved September 8, 2023.\nAvertium. (n.d.). EVERYTHING YOU NEED TO KNOW ABOUT CALLBACK PHISHING. Retrieved February 2, 2023.\nParisi, T. (2022, December 2). Not a SIMulation: CrowdStrike Investigations Reveal Intrusion Campaign Targeting Telco and BPO Companies. Retrieved June 30, 2023.\nMSTIC, DART, M365 Defender. (2022, March 24). DEV-0537 Criminal Actor Targeting Organizations for Data Exfiltration and Destruction. Retrieved May 17, 2022.\nCISA. (2021, February 1). Avoiding Social Engineering and Phishing Attacks. Retrieved September 8, 2023.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Phishing for Information: Spearphishing Link, Sub-technique T1598.003 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1598/003/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nPhishing for Information\nSpearphishing Link\nPhishing for Information: Spearphishing Link\nOther sub-techniques of Phishing for Information (4)\n\nAdversaries may send spearphishing messages with a malicious link to elicit sensitive information that can be used during targeting. Spearphishing for information is an attempt to trick targets into divulging information, frequently credentials or other actionable information. Spearphishing for information frequently involves social engineering techniques, such as posing as a source with a reason to collect information (ex: Establish Accounts or Compromise Accounts) and/or sending multiple, seemingly urgent messages.\n\nAll forms of spearphishing are electronically delivered social engineering targeted at a specific individual, company, or industry. In this scenario, the malicious emails contain links generally accompanied by social engineering text to coax the user to actively click or copy and paste a URL into a browser.[1][2] The given website may be a clone of a legitimate site (such as an online or corporate login portal) or may closely resemble a legitimate site in appearance and have a URL containing elements from the real site. URLs may also be obfuscated by taking advantage of quirks in the URL schema, such as the acceptance of integer- or hexadecimal-based hostname formats and the automatic discarding of text before an \"@\" symbol: for example, hxxp://google.com@1157586937.[3]\n\nAdversaries may also link to \"web bugs\" or \"web beacons\" within phishing messages to verify the receipt of an email, while also potentially profiling and tracking victim information such as IP address.[4]\n\nAdversaries may also be able to spoof a complete website using what is known as a \"browser-in-the-browser\" (BitB) attack. By generating a fake browser popup window with an HTML-based address bar that appears to contain a legitimate URL (such as an authentication portal), they may be able to prompt users to enter their credentials while bypassing typical URL verification methods.[5][6]\n\nAdversaries can use phishing kits such as EvilProxy and Evilginx2 to proxy the connection between the victim and the legitimate website. On a successful login, the victim is redirected to the legitimate website, while the adversary captures their session cookie (i.e., Steal Web Session Cookie) in addition to their username and password. This may enable the adversary to then bypass MFA via Web Session Cookie.[7]\n\nFrom the fake website, information is gathered in web forms and sent to the adversary. Adversaries may also use information from previous reconnaissance efforts (ex: Search Open Websites/Domains or Search Victim-Owned Websites) to craft persuasive and believable lures.\n\nID: T1598.003\nSub-technique of:  T1598\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nContributors: Austin Herrin; Elpidoforos Maragkos, @emaragkos; Joas Antonio dos Santos, @C0d3Cr4zy; Menachem Goldstein; Philip Winther; Robert Simmons, @MalwareUtkonos; Sebastian Salla, McAfee\nVersion: 1.5\nCreated: 02 October 2020\nLast Modified: 02 October 2023\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nS0677\tAADInternals\t\n\nAADInternals can send phishing emails containing malicious links designed to collect users’ credentials.[8]\n\n\nG0007\tAPT28\t\n\nAPT28 has conducted credential phishing campaigns with embedded links to attacker-controlled domains.[9]\n\n\nG0050\tAPT32\t\n\nAPT32 has used malicious links to direct users to web pages designed to harvest credentials.[10]\n\n\nG0035\tDragonfly\t\n\nDragonfly has used spearphishing with PDF attachments containing malicious links that redirected to credential harvesting websites.[11]\n\n\nG0094\tKimsuky\t\n\nKimsuky has used links in e-mail to steal account information.[12][13][14]\n\n\nG0059\tMagic Hound\t\n\nMagic Hound has used SMS and email messages with links designed to steal credentials or track victims.[15][16][17][18][19][20]\n\n\nG0129\tMustang Panda\t\n\nMustang Panda has delivered web bugs to profile their intended targets.[21]\n\n\nG0040\tPatchwork\t\n\nPatchwork has used embedded image tags (known as web bugs) with unique, per-recipient tracking links in their emails for the purpose of identifying which recipients opened messages.[22]\n\n\nG0034\tSandworm Team\t\n\nSandworm Team has crafted spearphishing emails with hyperlinks designed to trick unwitting recipients into revealing their account credentials.[23]\n\n\nG0121\tSidewinder\t\n\nSidewinder has sent e-mails with malicious links to credential harvesting websites.[24]\n\n\nG0122\tSilent Librarian\t\n\nSilent Librarian has used links in e-mails to direct victims to credential harvesting websites designed to appear like the targeted organization's login page.[25][26][27][28][29][30]\n\n\nS0649\tSMOKEDHAM\t\n\nSMOKEDHAM has been delivered via malicious links in phishing emails.[31]\n\n\nG0128\tZIRCONIUM\t\n\nZIRCONIUM has used web beacons in e-mails to track hits to attacker-controlled URL's.[32]\n\nMitigations\nID\tMitigation\tDescription\nM1054\tSoftware Configuration\t\n\nUse anti-spoofing and email authentication mechanisms to filter messages based on validity checks of the sender domain (using SPF) and integrity of messages (using DKIM). Enabling these mechanisms within an organization (through policies such as DMARC) may enable recipients (intra-org and cross domain) to perform similar message filtering and validation.[33][34]\n\nFurthermore, policies may enforce / install browser extensions that protect against IDN and homograph attacks. Browser password managers may also be configured to only populate credential fields when the URL matches that of the original, legitimate site.\n\n\nM1017\tUser Training\t\n\nUsers can be trained to identify social engineering techniques and spearphishing attempts. Additionally, users may perform visual checks of the domains they visit; however, homographs in ASCII and in IDN domains and URL schema obfuscation may render manual checks difficult. Phishing training and other cybersecurity training may raise awareness to check URLs before visiting the sites.\n\nDetection\nID\tData Source\tData Component\tDetects\nDS0015\tApplication Log\tApplication Log Content\t\n\nMonitor for suspicious email activity, such as numerous accounts receiving messages from a single unusual/unknown sender. Filtering based on DKIM+SPF or header analysis can help detect when the email sender is spoofed.[33][34] Monitor for references to uncategorized or known-bad sites. URL inspection within email (including expanding shortened links and identifying obfuscated URLs) can also help detect links leading to known malicious sites.[3]\n\nFurthermore, monitor browser logs for homographs in ASCII and in internationalized domain names abusing different character sets (e.g. Cyrillic vs Latin versions of trusted sites).\n\n\nDS0029\tNetwork Traffic\tNetwork Traffic Content\t\n\nMonitor and analyze traffic patterns and packet inspection associated to protocol(s), leveraging SSL/TLS inspection for encrypted traffic, that do not follow the expected protocol standards and traffic flows (e.g extraneous packets that do not belong to established flows, gratuitous or anomalous traffic patterns, anomalous syntax, or structure). Consider correlation with process monitoring and command line to detect anomalous processes execution and command line arguments associated to traffic patterns (e.g. monitor anomalies in use of files that do not normally initiate connections for respective protocol(s)).\n\nFurthermore, monitor network traffic for homographs via the use of internationalized domain names abusing different character sets (e.g. Cyrillic vs Latin versions of trusted sites). Also monitor and analyze traffic patterns and packet inspection for indicators of cloned websites. For example, if adversaries use HTTrack to clone websites, Mirrored from (victim URL) may be visible in the HTML section of packets.\n\n\n\t\tNetwork Traffic Flow\t\n\nMonitor network data for uncommon data flows. Processes utilizing the network that do not normally have network communication or have never been seen before are suspicious.\n\nReferences\nBabon, P. (2020, September 3). Tricky 'Forms' of Phishing. Retrieved October 20, 2020.\nKan, M. (2019, October 24). Hackers Try to Phish United Nations Staffers With Fake Login Pages. Retrieved October 20, 2020.\nNick Simonian. (2023, May 22). Don't @ Me: URL Obfuscation Through Schema Abuse. Retrieved August 4, 2023.\nNIST Information Technology Laboratory. (n.d.). web bug. Retrieved March 22, 2023.\nZScaler. (2020, February 11). Fake Sites Stealing Steam Credentials. Retrieved March 8, 2023.\nmr.d0x. (2022, March 15). Browser In The Browser (BITB) Attack. Retrieved March 8, 2023.\nProofpoint. (n.d.). The Human Factor 2023: Analyzing the cyber attack chain. Retrieved July 20, 2023.\nDr. Nestori Syynimaa. (2018, October 25). AADInternals. Retrieved February 18, 2022.\nHuntley, S. (2022, March 7). An update on the threat landscape. Retrieved March 16, 2022.\nAdair, S. and Lancaster, T. (2020, November 6). OceanLotus: Extending Cyber Espionage Operations Through Fake Websites. Retrieved November 20, 2020.\nUS-CERT. (2018, March 16). Alert (TA18-074A): Russian Government Cyber Activity Targeting Energy and Other Critical Infrastructure Sectors. Retrieved June 6, 2018.\nKim, J. et al. (2019, October). KIMSUKY GROUP: TRACKING THE KING OF THE SPEAR PHISHING. Retrieved November 2, 2020.\nJazi, H. (2021, June 1). Kimsuky APT continues to target South Korean government using AppleSeed backdoor. Retrieved June 10, 2021.\nKISA. (n.d.). Phishing Target Reconnaissance and Attack Resource Analysis Operation Muzabi. Retrieved March 7, 2022.\nCertfa Labs. (2021, January 8). Charming Kitten’s Christmas Gift. Retrieved May 3, 2021.\nClearSky Research Team. (2020, August 1). The Kittens Are Back in Town 3 - Charming Kitten Campaign Evolved and Deploying Spear-Phishing link by WhatsApp. Retrieved April 21, 2021.\nMiller, J. et al. (2021, March 30). BadBlood: TA453 Targets US and Israeli Medical Research Personnel in Credential Phishing Campaigns. Retrieved May 4, 2021.\nMiller, J. et al. (2021, July 13). Operation SpoofedScholars: A Conversation with TA453. Retrieved August 18, 2021.\nBash, A. (2021, October 14). Countering threats from Iran. Retrieved January 4, 2023.\nMSTIC. (2021, November 16). Evolving trends in Iranian threat actor activity – MSTIC presentation at CyberWarCon 2021. Retrieved January 12, 2023.\nRaggi, M. et al. (2022, March 7). The Good, the Bad, and the Web Bug: TA416 Increases Operational Tempo Against European Governments as Conflict in Ukraine Escalates. Retrieved March 16, 2022.\nMeltzer, M, et al. (2018, June 07). Patchwork APT Group Targets US Think Tanks. Retrieved July 16, 2018.\nScott W. Brady. (2020, October 15). United States vs. Yuriy Sergeyevich Andrienko et al.. Retrieved November 25, 2020.\nHegel, T. (2021, January 13). A Global Perspective of the SideWinder APT. Retrieved January 27, 2021.\nDOJ. (2018, March 23). U.S. v. Rafatnejad et al . Retrieved February 3, 2021.\nHassold, Crane. (2018, March 26). Silent Librarian: More to the Story of the Iranian Mabna Institute Indictment. Retrieved February 3, 2021.\nCounter Threat Unit Research Team. (2018, August 24). Back to School: COBALT DICKENS Targets Universities. Retrieved February 3, 2021.\nProofpoint Threat Insight Team. (2019, September 5). Threat Actor Profile: TA407, the Silent Librarian. Retrieved February 3, 2021.\nCounter Threat Unit Research Team. (2019, September 11). COBALT DICKENS Goes Back to School…Again. Retrieved February 3, 2021.\nMalwarebytes Threat Intelligence Team. (2020, October 14). Silent Librarian APT right on schedule for 20/21 academic year. Retrieved February 3, 2021.\nFireEye. (2021, May 11). Shining a Light on DARKSIDE Ransomware Operations. Retrieved September 22, 2021.\nBurt, T. (2020, September 10). New cyberattacks targeting U.S. elections. Retrieved March 24, 2021.\nMicrosoft. (2020, October 13). Anti-spoofing protection in EOP. Retrieved October 19, 2020.\nAustralian Cyber Security Centre. (2012, December). Mitigating Spoofed Emails Using Sender Policy Framework. Retrieved October 19, 2020.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Phishing for Information: Spearphishing Service, Sub-technique T1598.001 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1598/001/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nPhishing for Information\nSpearphishing Service\nPhishing for Information: Spearphishing Service\nOther sub-techniques of Phishing for Information (4)\n\nAdversaries may send spearphishing messages via third-party services to elicit sensitive information that can be used during targeting. Spearphishing for information is an attempt to trick targets into divulging information, frequently credentials or other actionable information. Spearphishing for information frequently involves social engineering techniques, such as posing as a source with a reason to collect information (ex: Establish Accounts or Compromise Accounts) and/or sending multiple, seemingly urgent messages.\n\nAll forms of spearphishing are electronically delivered social engineering targeted at a specific individual, company, or industry. In this scenario, adversaries send messages through various social media services, personal webmail, and other non-enterprise controlled services.[1] These services are more likely to have a less-strict security policy than an enterprise. As with most kinds of spearphishing, the goal is to generate rapport with the target or get the target's interest in some way. Adversaries may create fake social media accounts and message employees for potential job opportunities. Doing so allows a plausible reason for asking about services, policies, and information about their environment. Adversaries may also use information from previous reconnaissance efforts (ex: Social Media or Search Victim-Owned Websites) to craft persuasive and believable lures.\n\nID: T1598.001\nSub-technique of:  T1598\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nContributors: Robert Simmons, @MalwareUtkonos\nVersion: 1.0\nCreated: 02 October 2020\nLast Modified: 15 April 2021\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nC0027\tC0027\t\n\nDuring C0027, Scattered Spider sent Telegram messages impersonating IT personnel to harvest credentials.[2]\n\nMitigations\nID\tMitigation\tDescription\nM1017\tUser Training\t\n\nUsers can be trained to identify social engineering techniques and spearphishing attempts.\n\nDetection\nID\tData Source\tData Component\tDetects\nDS0015\tApplication Log\tApplication Log Content\t\n\nMonitor social media traffic for suspicious activity, including messages requesting information as well as abnormal file or data transfers (especially those involving unknown, or otherwise suspicious accounts).Much of this activity may have a very high occurrence and associated false positive rate, as well as potentially taking place outside the visibility of the target organization, making detection difficult for defenders.Detection efforts may be focused on related stages of the adversary lifecycle, such as during Initial Access.\n\n\nDS0029\tNetwork Traffic\tNetwork Traffic Content\t\n\nMonitor and analyze traffic patterns and packet inspection associated to protocol(s) that do not follow the expected protocol standards and traffic flows (e.g extraneous packets that do not belong to established flows, gratuitous or anomalous traffic patterns, anomalous syntax, or structure). Consider correlation with process monitoring and command line to detect anomalous processes execution and command line arguments associated to traffic patterns (e.g. monitor anomalies in use of files that do not normally initiate connections for respective protocol(s)).\n\n\n\t\tNetwork Traffic Flow\t\n\nMonitor network data for uncommon data flows. Processes utilizing the network that do not normally have network communication or have never been seen before are suspicious.\n\nReferences\nO'Donnell, L. (2020, October 20). Facebook: A Top Launching Pad For Phishing Attacks. Retrieved October 20, 2020.\nParisi, T. (2022, December 2). Not a SIMulation: CrowdStrike Investigations Reveal Intrusion Campaign Targeting Telco and BPO Companies. Retrieved June 30, 2023.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Phishing for Information: Spearphishing Attachment, Sub-technique T1598.002 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1598/002/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nPhishing for Information\nSpearphishing Attachment\nPhishing for Information: Spearphishing Attachment\nOther sub-techniques of Phishing for Information (4)\n\nAdversaries may send spearphishing messages with a malicious attachment to elicit sensitive information that can be used during targeting. Spearphishing for information is an attempt to trick targets into divulging information, frequently credentials or other actionable information. Spearphishing for information frequently involves social engineering techniques, such as posing as a source with a reason to collect information (ex: Establish Accounts or Compromise Accounts) and/or sending multiple, seemingly urgent messages.\n\nAll forms of spearphishing are electronically delivered social engineering targeted at a specific individual, company, or industry. In this scenario, adversaries attach a file to the spearphishing email and usually rely upon the recipient populating information then returning the file.[1][2] The text of the spearphishing email usually tries to give a plausible reason why the file should be filled-in, such as a request for information from a business associate. Adversaries may also use information from previous reconnaissance efforts (ex: Search Open Websites/Domains or Search Victim-Owned Websites) to craft persuasive and believable lures.\n\nID: T1598.002\nSub-technique of:  T1598\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nContributors: Philip Winther; Robert Simmons, @MalwareUtkonos; Sebastian Salla, McAfee\nVersion: 1.1\nCreated: 02 October 2020\nLast Modified: 15 April 2021\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nG0035\tDragonfly\t\n\nDragonfly has used spearphishing with Microsoft Office attachments to enable harvesting of user credentials.[3]\n\n\nG1008\tSideCopy\t\n\nSideCopy has crafted generic lures for spam campaigns to collect emails and credentials for targeting efforts.[4]\n\n\nG0121\tSidewinder\t\n\nSidewinder has sent e-mails with malicious attachments that lead victims to credential harvesting websites.[5][6][7]\n\nMitigations\nID\tMitigation\tDescription\nM1054\tSoftware Configuration\t\n\nUse anti-spoofing and email authentication mechanisms to filter messages based on validity checks of the sender domain (using SPF) and integrity of messages (using DKIM). Enabling these mechanisms within an organization (through policies such as DMARC) may enable recipients (intra-org and cross domain) to perform similar message filtering and validation.[8][9]\n\n\nM1017\tUser Training\t\n\nUsers can be trained to identify social engineering techniques and spearphishing attempts.\n\nDetection\nID\tData Source\tData Component\tDetects\nDS0015\tApplication Log\tApplication Log Content\t\n\nMonitor for suspicious email activity, such as numerous accounts receiving messages from a single unusual/unknown sender. Filtering based on DKIM+SPF or header analysis can help detect when the email sender is spoofed.[8][9]\n\n\nDS0029\tNetwork Traffic\tNetwork Traffic Content\t\n\nMonitor and analyze traffic patterns and packet inspection associated to protocol(s) that do not follow the expected protocol standards and traffic flows (e.g extraneous packets that do not belong to established flows, gratuitous or anomalous traffic patterns, anomalous syntax, or structure). Consider correlation with process monitoring and command line to detect anomalous processes execution and command line arguments associated to traffic patterns (e.g. monitor anomalies in use of files that do not normally initiate connections for respective protocol(s)).\n\n\n\t\tNetwork Traffic Flow\t\n\nMonitor network data for uncommon data flows. Processes utilizing the network that do not normally have network communication or have never been seen before are suspicious.\n\nReferences\nDucklin, P. (2020, October 2). Serious Security: Phishing without links – when phishers bring along their own web pages. Retrieved October 20, 2020.\nRyan Hanson. (2016, September 24). phishery. Retrieved October 23, 2020.\nUS-CERT. (2018, March 16). Alert (TA18-074A): Russian Government Cyber Activity Targeting Energy and Other Critical Infrastructure Sectors. Retrieved June 6, 2018.\nThreat Intelligence Team. (2021, December 2). SideCopy APT: Connecting lures victims, payloads to infrastructure. Retrieved June 13, 2022.\nHegel, T. (2021, January 13). A Global Perspective of the SideWinder APT. Retrieved January 27, 2021.\nRewterz. (2020, April 20). Sidewinder APT Group Campaign Analysis. Retrieved January 29, 2021.\nCyble. (2020, September 26). SideWinder APT Targets with futuristic Tactics and Techniques. Retrieved January 29, 2021.\nMicrosoft. (2020, October 13). Anti-spoofing protection in EOP. Retrieved October 19, 2020.\nAustralian Cyber Security Centre. (2012, December). Mitigating Spoofed Emails Using Sender Policy Framework. Retrieved October 19, 2020.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  },
  {
    "title": "Phishing for Information, Technique T1598 - Enterprise | MITRE ATT&CK®",
    "url": "https://attack.mitre.org/techniques/T1598/",
    "html": "Matrices \nTactics \nTechniques \nDefenses \nCTI \nResources \nBenefactors\nBlog  \nSearch \nThank you to Tidal Cyber and SOC Prime for becoming ATT&CK's first Benefactors. To join the cohort, or learn more about this program visit our Benefactors page.\nHome\nTechniques\nEnterprise\nPhishing for Information\nPhishing for Information\nSub-techniques (4)\n\nAdversaries may send phishing messages to elicit sensitive information that can be used during targeting. Phishing for information is an attempt to trick targets into divulging information, frequently credentials or other actionable information. Phishing for information is different from Phishing in that the objective is gathering data from the victim rather than executing malicious code.\n\nAll forms of phishing are electronically delivered social engineering. Phishing can be targeted, known as spearphishing. In spearphishing, a specific individual, company, or industry will be targeted by the adversary. More generally, adversaries can conduct non-targeted phishing, such as in mass credential harvesting campaigns.\n\nAdversaries may also try to obtain information directly through the exchange of emails, instant messages, or other electronic conversation means.[1][2][3][4][5] Victims may also receive phishing messages that direct them to call a phone number where the adversary attempts to collect confidential information.[6]\n\nPhishing for information frequently involves social engineering techniques, such as posing as a source with a reason to collect information (ex: Establish Accounts or Compromise Accounts) and/or sending multiple, seemingly urgent messages. Another way to accomplish this is by forging or spoofing[7] the identity of the sender which can be used to fool both the human recipient as well as automated security tools.[8]\n\nPhishing for information may also involve evasive techniques, such as removing or manipulating emails or metadata/headers from compromised accounts being abused to send messages (e.g., Email Hiding Rules).[9][10]\n\nID: T1598\nSub-techniques:  T1598.001, T1598.002, T1598.003, T1598.004\nⓘ\nTactic: Reconnaissance\nⓘ\nPlatforms: PRE\nContributors: Liora Itkin; Liran Ravich, CardinalOps; Ohad Zaidenberg, @ohad_mz; Philip Winther; Robert Simmons, @MalwareUtkonos; Scott Cook, Capital One; Sebastian Salla, McAfee\nVersion: 1.3\nCreated: 02 October 2020\nLast Modified: 08 September 2023\nVersion Permalink\nProcedure Examples\nID\tName\tDescription\nG0007\tAPT28\t\n\nAPT28 has used spearphishing to compromise credentials.[11][12]\n\n\nG1015\tScattered Spider\t\n\nScattered Spider has used a combination of credential phishing and social engineering to capture one-time-password (OTP) codes.[13]\n\n\nG0128\tZIRCONIUM\t\n\nZIRCONIUM targeted presidential campaign staffers with credential phishing e-mails.[14]\n\nMitigations\nID\tMitigation\tDescription\nM1054\tSoftware Configuration\t\n\nUse anti-spoofing and email authentication mechanisms to filter messages based on validity checks of the sender domain (using SPF) and integrity of messages (using DKIM). Enabling these mechanisms within an organization (through policies such as DMARC) may enable recipients (intra-org and cross domain) to perform similar message filtering and validation.[15][16]\n\n\nM1017\tUser Training\t\n\nUsers can be trained to identify social engineering techniques and spearphishing attempts.\n\nDetection\nID\tData Source\tData Component\tDetects\nDS0015\tApplication Log\tApplication Log Content\t\n\nDepending on the specific method of phishing, the detections can vary. Monitor for suspicious email activity, such as numerous accounts receiving messages from a single unusual/unknown sender. Filtering based on DKIM+SPF or header analysis can help detect when the email sender is spoofed.[15][16]When it comes to following links, monitor for references to uncategorized or known-bad sites. URL inspection within email (including expanding shortened links) can also help detect links leading to known malicious sites.Monitor social media traffic for suspicious activity, including messages requesting information as well as abnormal file or data transfers (especially those involving unknown, or otherwise suspicious accounts).\n\nMonitor call logs from corporate devices to identify patterns of potential voice phishing, such as calls to/from known malicious phone numbers.\n\n\nDS0029\tNetwork Traffic\tNetwork Traffic Content\t\n\nMonitor and analyze traffic patterns and packet inspection associated to protocol(s) that do not follow the expected protocol standards and traffic flows (e.g extraneous packets that do not belong to established flows, gratuitous or anomalous traffic patterns, anomalous syntax, or structure). Consider correlation with process monitoring and command line to detect anomalous processes execution and command line arguments associated to traffic patterns (e.g. monitor anomalies in use of files that do not normally initiate connections for respective protocol(s)).\n\n\n\t\tNetwork Traffic Flow\t\n\nMonitor network data for uncommon data flows. Processes utilizing the network that do not normally have network communication or have never been seen before are suspicious.\n\nReferences\nO'Donnell, L. (2020, October 20). Facebook: A Top Launching Pad For Phishing Attacks. Retrieved October 20, 2020.\nBabon, P. (2020, September 3). Tricky 'Forms' of Phishing. Retrieved October 20, 2020.\nKan, M. (2019, October 24). Hackers Try to Phish United Nations Staffers With Fake Login Pages. Retrieved October 20, 2020.\nDucklin, P. (2020, October 2). Serious Security: Phishing without links – when phishers bring along their own web pages. Retrieved October 20, 2020.\nRyan Hanson. (2016, September 24). phishery. Retrieved October 23, 2020.\nAvertium. (n.d.). EVERYTHING YOU NEED TO KNOW ABOUT CALLBACK PHISHING. Retrieved February 2, 2023.\nProofpoint. (n.d.). What Is Email Spoofing?. Retrieved February 24, 2023.\nItkin, Liora. (2022, September 1). Double-bounced attacks with email spoofing . Retrieved February 24, 2023.\nMicrosoft. (2023, September 22). Malicious OAuth applications abuse cloud email services to spread spam. Retrieved March 13, 2023.\nVicky Ray and Rob Downs. (2014, October 29). Examining a VBA-Initiated Infostealer Campaign. Retrieved March 13, 2023.\nBurt, T. (2020, September 10). New cyberattacks targeting U.S. elections. Retrieved March 24, 2021.\nSecureworks CTU. (2017, March 30). IRON TWILIGHT Supports Active Measures. Retrieved February 28, 2022.\nCrowdStrike. (2023, January 10). SCATTERED SPIDER Exploits Windows Security Deficiencies with Bring-Your-Own-Vulnerable-Driver Tactic in Attempt to Bypass Endpoint Security. Retrieved July 5, 2023.\nHuntley, S. (2020, October 16). How We're Tackling Evolving Online Threats. Retrieved March 24, 2021.\nMicrosoft. (2020, October 13). Anti-spoofing protection in EOP. Retrieved October 19, 2020.\nAustralian Cyber Security Centre. (2012, December). Mitigating Spoofed Emails Using Sender Policy Framework. Retrieved October 19, 2020.\nContact Us\nTerms of Use\nPrivacy Policy\nWebsite Changelog\n© 2015 - 2024, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\n "
  }
]
